GH_IO.Types.GH_Types
Contains flags for all data types currently supported by GH_IO.dll

GH_IO.Types.GH_Types.unset
Represents an unset type. GH_Items with this type will throw exceptions during serialization.

GH_IO.Types.GH_Types.gh_bool
boolean

GH_IO.Types.GH_Types.gh_byte
byte

GH_IO.Types.GH_Types.gh_int32
32 bit integer

GH_IO.Types.GH_Types.gh_int64
64 bit integer

GH_IO.Types.GH_Types.gh_single
single precision floating point number

GH_IO.Types.GH_Types.gh_double
double precision floating point number

GH_IO.Types.GH_Types.gh_decimal
decimal number

GH_IO.Types.GH_Types.gh_date
date time structure

GH_IO.Types.GH_Types.gh_guid
128 bit globally unique identifier

GH_IO.Types.GH_Types.gh_string
unicode string

GH_IO.Types.GH_Types.gh_bytearray
an array of bytes

GH_IO.Types.GH_Types.gh_drawing_point
gdi+ integer precision point

GH_IO.Types.GH_Types.gh_drawing_pointf
gdi+ single precision point

GH_IO.Types.GH_Types.gh_drawing_size
gdi+ integer precision size

GH_IO.Types.GH_Types.gh_drawing_sizef
gdi+ single precision size

GH_IO.Types.GH_Types.gh_drawing_rectangle
gdi+ integer precision rectangle

GH_IO.Types.GH_Types.gh_drawing_rectanglef
gdi+ single precision rectangle

GH_IO.Types.GH_Types.gh_drawing_color
gdi+ argb color

GH_IO.Types.GH_Types.gh_drawing_bitmap
gdi+ bitmap (png format bytestream)

GH_IO.Types.GH_Types.gh_point2d
double precision two-dimensional point

GH_IO.Types.GH_Types.gh_point3d
double precision three-dimensional point

GH_IO.Types.GH_Types.gh_point4d
double precision four-dimensional point

GH_IO.Types.GH_Types.gh_interval1d
double precision one-dimensional numeric interval

GH_IO.Types.GH_Types.gh_interval2d
double precision two-dimensional numeric interval

GH_IO.Types.GH_Types.gh_line
double precision three-dimensional line segment

GH_IO.Types.GH_Types.gh_boundingbox
double precision three-dimensional box volume

GH_IO.Types.GH_Types.gh_plane
double precision three-dimensional plane construct

GH_IO.Types.GH_Types.gh_version
version structure with major, minor and revision fields