GH_IO.Serialization.EncodedStringWriter
This class is needed to override the UTF-16 encoding property of the default DotNET StringWriter.

GH_IO.Serialization.EncodedStringWriter.#ctor
Constructor for StringWriter

GH_IO.Serialization.EncodedStringWriter.Encoding
Always return UTF-8.