GH_IO.Serialization.GH_IBinarySupport
Interface which declares all methods required for objects that
can be (de)serialized to and from a binary archive.

GH_IO.Serialization.GH_IBinarySupport.Write(System.IO.BinaryWriter)
Called when an object is required to serialize itself.
writer: Writer object to be used for serialization.

GH_IO.Serialization.GH_IBinarySupport.Read(System.IO.BinaryReader)
Called when an object is required to deserialize itself.
reader: Reader object to be used for deserialization.