GH_IO.Serialization.GH_Message_Type
Message type flag.

GH_IO.Serialization.GH_Message_Type.info
Indicates a message represents information.

GH_IO.Serialization.GH_Message_Type.warning
Indicates the message represents a warning. Warnings are not severe enough to be regarded as IO errors.

GH_IO.Serialization.GH_Message_Type.error
Indicates the message represents an error. Errors mean (de)serialization failed (partially).