GH_IO.Types.GH_Item
Represents a single data item in a chunk.

GH_IO.Types.GH_Item.#ctor(System.String,System.Boolean)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Boolean)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Byte)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Byte)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Int32)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int64)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Int64)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Single)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Single)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Double)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Double)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Decimal)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Decimal)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.DateTime)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.DateTime)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Guid)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Guid)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.String)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.String)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Byte[])
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Byte[])
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Drawing.Point)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Drawing.Point)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Drawing.PointF)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Drawing.PointF)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Drawing.Size)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Drawing.Size)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Drawing.SizeF)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Drawing.SizeF)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Drawing.Rectangle)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Drawing.Rectangle)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Drawing.RectangleF)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Drawing.RectangleF)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Drawing.Color)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Drawing.Color)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Drawing.Bitmap)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Drawing.Bitmap)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,GH_IO.Types.GH_Point2D)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,GH_IO.Types.GH_Point2D)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,GH_IO.Types.GH_Point3D)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,GH_IO.Types.GH_Point3D)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,GH_IO.Types.GH_Point4D)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,GH_IO.Types.GH_Point4D)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,GH_IO.Types.GH_Interval1D)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,GH_IO.Types.GH_Interval1D)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,GH_IO.Types.GH_Interval2D)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,GH_IO.Types.GH_Interval2D)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,GH_IO.Types.GH_Line)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,GH_IO.Types.GH_Line)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,GH_IO.Types.GH_BoundingBox)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,GH_IO.Types.GH_BoundingBox)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,GH_IO.Types.GH_Plane)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,GH_IO.Types.GH_Plane)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,GH_IO.Types.GH_Version)
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,GH_IO.Types.GH_Version)
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.CreateFrom(System.IO.BinaryReader)
Creates a new instance of GH_Item and sets the fields from a reader object.
reader: Reader object that defines the field data.
Returns: The constructed and read item.

GH_IO.Types.GH_Item.CreateFrom(System.Xml.XmlNode)
Creates a new instance of GH_Item and sets the fields from an Xml node object.
node: Xml node object that defines the field data.
Returns: The constructed and read item.

GH_IO.Types.GH_Item.Write(System.IO.BinaryWriter)
Serialize this item into a binary stream.
writer: Writer to serialize with.
Throws System.MemberAccessException: Thrown if !HasName.
Throws System.MemberAccessException: Thrown if !HasType.
Throws System.IO.IOException: Thrown if the internal data could not be serialized.

GH_IO.Types.GH_Item.Read(System.IO.BinaryReader)
Deserialize this item from a binary stream.
reader: Reader to deserialize with.

GH_IO.Types.GH_Item.Write(System.Xml.XmlWriter)
Serialize this item into an Xml stream.
writer: Writer to serialize with.
Throws System.MemberAccessException: Thrown if !HasName.
Throws System.MemberAccessException: Thrown if !HasType.
Throws System.IO.IOException: Thrown if the internal data could not be serialized.

GH_IO.Types.GH_Item.SanitizeXMLString(System.String)
Remove invalid XML chars from a string.
xml: Xml string to sanitize.
Returns: A sanitized string.

GH_IO.Types.GH_Item.IsLegalXmlChar(System.Int32)
Test whether a character UTF8 code is a valid Xml char.
character: Char code to test.
Returns: True if the character is a valid Xml char.

GH_IO.Types.GH_Item.Read(System.Xml.XmlNode)
Deserialize this item from an Xml node.
node: Xml node to serialize from.

GH_IO.Types.GH_Item.ToString
Converts the struct into a human readable format.

GH_IO.Types.GH_Item.HasType
Gets the type set validity of this item.
The item is considered to have a type if type != GH_Types.unset

GH_IO.Types.GH_Item.HasName
Gets the name validity of this item.
The item is considered to have an invalid name if string.IsNullOrEmpty(name)

GH_IO.Types.GH_Item.HasIndex
Gets the index existence implication. The item is considered to have an index qualifier
if the index value is larger than or equal to zero.

GH_IO.Types.GH_Item.Type
Gets the type of this item.
Type flags are set during construction and cannot be altered.

GH_IO.Types.GH_Item.Name
Gets or sets the name of this item.
Typically, names are set at construction and do not change.
If you change names after construction, you could corrupt an archive.
Throws System.ArgumentNullException: Thrown if the new name is null or empty.

GH_IO.Types.GH_Item.Index
Gets or sets the index of an item.
Typically, indices are set at construction and do not change.
If you change indices after construction, you could corrupt an archive.
Negative indices are clamped to -1.

GH_IO.Types.GH_Item.DebuggerDisplay
Readonly property used during Debugging.

GH_IO.Types.GH_Item.InternalData
Retrieves the internal data of this item.
No type casting is performed.

GH_IO.Types.GH_Item._bool
Returns the internal data of this item cast to a Boolean.
If the data is not stored as a Boolean, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._byte
Returns the internal data of this item cast to a Byte.
If the data is not stored as a Byte, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._int32
Returns the internal data of this item cast to an Int32.
If the data is not stored as an Int32, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._int64
Returns the internal data of this item cast to an Int64.
If the data is not stored as an Int64, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._single
Returns the internal data of this item cast to a Single.
If the data is not stored as a Single, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._double
Returns the internal data of this item cast to a Double.
If the data is not stored as a Double, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._decimal
Returns the internal data of this item cast to a Decimal.
If the data is not stored as a Decimal, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._date
Returns the internal data of this item cast to a DateTime.
If the data is not stored as a DateTime, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._guid
Returns the internal data of this item cast to a Guid.
If the data is not stored as a Guid, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._string
Returns the internal data of this item cast to a String.
If the data is not stored as a String, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._bytearray
Returns the internal data of this item cast to a Byte array.
If the data is not stored as a Byte array, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._drawing_point
Returns the internal data of this item cast to a Point.
If the data is not stored as a Point, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._drawing_pointf
Returns the internal data of this item cast to a PointF.
If the data is not stored as a PointF, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._drawing_size
Returns the internal data of this item cast to a Size.
If the data is not stored as a Size, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._drawing_sizef
Returns the internal data of this item cast to a SizeF.
If the data is not stored as a SizeF, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._drawing_rectangle
Returns the internal data of this item cast to a Rectangle.
If the data is not stored as a Rectangle, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._drawing_rectanglef
Returns the internal data of this item cast to a RectangleF.
If the data is not stored as a RectangleF, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._drawing_color
Returns the internal data of this item cast to a Color.
If the data is not stored as a Color, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._drawing_bitmap
Returns the internal data of this item cast to a Bitmap.
If the data is not stored as a Bitmap, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._point2d
Returns the internal data of this item cast to a Point2D.
If the data is not stored as a Point2D, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._point3d
Returns the internal data of this item cast to a Point3D.
If the data is not stored as a Point3D, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._point4d
Returns the internal data of this item cast to a Point4D.
If the data is not stored as a Point4D, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._interval1d
Returns the internal data of this item cast to an Interval1D.
If the data is not stored as an Interval1D, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._interval2d
Returns the internal data of this item cast to an Interval2D.
If the data is not stored as an Interval2D, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._line
Returns the internal data of this item cast to a Line.
If the data is not stored as a Line, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._boundingbox
Returns the internal data of this item cast to a BoundingBox.
If the data is not stored as a BoundingBox, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._plane
Returns the internal data of this item cast to a Plane.
If the data is not stored as a Plane, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.

GH_IO.Types.GH_Item._version
Returns the internal data of this item cast to a Version.
If the data is not stored as a Version, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.