GH_IO.Serialization.GH_Compression
Provides static methods for compression of byte-arrays.

GH_IO.Serialization.GH_Compression.#ctor
This class only exposes static methods and cannot be constructed.

GH_IO.Serialization.GH_Compression.Compress(System.Byte[])
Compress an array of bytes using the Deflate algorithm.
data: Byte array to compress.
Returns: An array of compressed bytes.

GH_IO.Serialization.GH_Compression.Decompress(System.Byte[])
Decompress an array of bytes using the Deflate algorithm.
compressedData: Byte array to decompress.
Returns: An array of decompressed bytes.