GH_IO.GH_ISerializable
Every object which needs to (de)serialize itself using GH_IO methodology
must implement this interface.

GH_IO.GH_ISerializable.Write(GH_IO.Serialization.GH_IWriter)
This method is called whenever the instance is required to serialize itself.
writer: Writer object to serialize with.
Returns: True on success, false on failure.

GH_IO.GH_ISerializable.Read(GH_IO.Serialization.GH_IReader)
This method is called whenever the instance is required to deserialize itself.
reader: Reader object to deserialize from.
Returns: True on success, false on failure.