GH_IO.Serialization.GH_Archive
This is the base archive class which takes care of all (de)serialization and messaging.

GH_IO.Serialization.GH_Archive.AddMessage(System.String,GH_IO.Serialization.GH_Message_Type)
Add a new message to the record.
message_text: Message text.
message_type: Message type.
Throws System.ArgumentNullException: Thrown if message text is null or empty.

GH_IO.Serialization.GH_Archive.AddMessage(GH_IO.Serialization.GH_Message)
Add a new message to the record.
message: Message to add
Throws System.ArgumentNullException: Thrown if the message is a null reference.

GH_IO.Serialization.GH_Archive.MessageCount
Gets the number of messages recorded since the most recent IO operation began.
Returns: The number of recorded messages.

GH_IO.Serialization.GH_Archive.MessageCount(System.Boolean,System.Boolean,System.Boolean)
Gets the number of messages recorded since the most recent IO operation began.
Message count can be filtered by message type.
includeInfo: If true, info messages will be included in the count.
includeWarnings: If true, warnings will be included in the count.
includeErrors: If true, errors will be included in the count.
Returns: The number of recoded messages that pass the type filters.

GH_IO.Serialization.GH_Archive.ClearMessages
Remove all messages from the log.

GH_IO.Serialization.GH_Archive.ShowMessageLog
Displays the message log viewer. You should typically only display the viewer if
the WorstCaseMessageType equals GH_Message_Type.warning or GH_Message_Type.error
Returns: The closing flag for the displayed log form.

GH_IO.Serialization.GH_Archive.CreateTopLevelNode(System.String)
Creates and returns a new root node for this archive in the form of a GH_IWriter instance.
Typically you do not call this method. If you want to add an object to the archive, use AppendObject() instead.
root_name: Name of root object.
Returns: The GH_IWriter incarnation of the GH_Chunk that represents the new Node.

GH_IO.Serialization.GH_Archive.CreateNewRoot(System.Boolean)
Discards the current data tree and instantiates a new root node.
This root node contains some comments, a version value containing the current version of GH_IO.dll
and a DateTime value containing the current date and time.
forWriting: If true, all data fields are reset.

GH_IO.Serialization.GH_Archive.CompareArchiveVersion
Parses the root node if it exists for Versioning information and creates
warning messages if the archive version is newer than the local version.

GH_IO.Serialization.GH_Archive.SaveFileDialog(System.String,System.String@,System.Collections.Generic.List{System.String})
Displays a standard SaveFileDialog with all the fields set to cater for Grasshopper files.
title: Title of the dialog. If null, the default title will be used.
file_path: Path to file picked by user. If file_path represents a valid string,
the dialog is set up to match.
additional_filters: A list of additional file format filters or null.
Filter strings must be in typical FileDialog.Filter syntax: "File Name (*.ext)|*.ext"
Returns: True is user picked a new path, False if user cancelled.

GH_IO.Serialization.GH_Archive.OpenFileDialog(System.String,System.String@,System.Collections.Generic.List{System.String})
Displays a standard OpenFileDialog with all the fields set to cater for Grasshopper files.
title: Title of the dialog. If null, the default title will be used.
file_path: Path to file picked by user.
If file_path represents a valid string,
the dialog is set up to match.
additional_filters: A list of additional file format filters or null.
Filter strings must be in typical FileDialog.Filter syntax: "File Name (*.ext)|*.ext"
Returns: True is user picked a path, False if user cancelled.

GH_IO.Serialization.GH_Archive.AppendObject(GH_IO.GH_ISerializable,System.String)
Appends a target object into the root node of this archive tree.
If the root doesn't exist yet, it will be created. Existing objects at the root scope
will not be affected.
target: Object to append. Cannot be null.
target_name: Name of object to append, name must be unique.
Returns: True on succes, false on failure.
Throws System.ArgumentNullException: Thrown if target is a null reference.
Throws System.ArgumentNullException: Thrown if the target_name is null or empty.
This sample shows how to create a new archive and serialize a single top level object.
bool CreateFile(string file_name, GH_ISerializable target, string target_name)
{
GH_Archive archive = new GH_Archive();
archive.AppendObject(target, target_name);
return archive.WriteToFile(file_name, true);
}

GH_IO.Serialization.GH_Archive.ExtractObject(GH_IO.GH_ISerializable,System.String)
Extract a target object from the data tree.
target: Object to extract. Cannot be null.
target_name: Name of object to extract, name must identify an existing chunk.
Returns: True on succes, false on failure.
Throws System.MemberAccessException: Thrown if the Root node hasn't been instantiated yet.
Throws System.ArgumentNullException: Thrown if target is a null reference.
Throws System.ArgumentNullException: Thrown if the target_name is null or empty.
Throws System.MemberAccessException: Thrown if the target_name cannot be resolved.

GH_IO.Serialization.GH_Archive.WriteToFile(System.String,System.Boolean,System.Boolean)
Writes the current tree to a file.
file_name: Path of file to write to. If the extension is not a recognized Grasshopper extension,
an exception will be thrown.
overwrite: True to overwrite file at specified location.
remember_path: If True, the MRU path field will be updated to reflect the new path.
Returns: True on succes, false if file already exists and overwrite is set to false.
Throws System.MemberAccessException: Thrown if the root of the current archive hasn't been instantiated yet.
Throws System.ArgumentNullException: Thrown if file_name is either null or empty.
Throws System.IO.IOException: Thrown if the file_name doesn't represent a known file extension.

GH_IO.Serialization.GH_Archive.ReadFromFile(System.String)
Reads a new archive tree from a file.
file_name: Path of file to parse.
Returns: True on success, false on failure. If the read operation fails,
all the member fields of this archive ought to be treated as invalid.
Throws System.IO.FileNotFoundException: Thrown if the file doesn't exist.
Throws System.IO.IOException: Thrown if the file_name doesn't represent a known file extension.

GH_IO.Serialization.GH_Archive.WriteToFile_Xml(System.String)
Serializes the current data tree into an Xml Grasshopper file.
file_name: Path of file to write.
Returns: True on success, or throws exceptions on failure.

GH_IO.Serialization.GH_Archive.WriteToFile_Binary(System.String)
Serializes the current data tree into a Binary Grasshopper file.
file_name: Path of file to write.
Returns: True on success, or throws exceptions on failure.

GH_IO.Serialization.GH_Archive.Serialize_Xml
Serializes the data tree into an Xml string.
Returns: A string containing the Xml content.
Throws System.MemberAccessException: Thrown if the root of the current archive hasn't been instantiated yet.

GH_IO.Serialization.GH_Archive.Deserialize_Xml(System.String)
Deserializes an Xml string.
xml_content: Xml to deserialize.
Returns: True on success, false on failure.
Throws System.Xml.XmlException: Thrown if xml_content is not a valid Grasshopper Xml stream.

GH_IO.Serialization.GH_Archive.Serialize_Binary
Serializes the data tree into a Binary byte array.
Returns: A byte array containing the Binary stream.
Throws System.MemberAccessException: Thrown if the root of the current archive hasn't been instantiated yet.

GH_IO.Serialization.GH_Archive.Deserialize_Binary(System.Byte[])
Deserializes an array of bytes.
data: Byte array to deserialize.
Returns: True on success, false on failure.
Throws System.ArgumentNullException: Thrown if data is a null reference.

GH_IO.Serialization.GH_Archive.GrasshopperBinaryExtension
Gets the file extension (including the dot) associated with Grasshopper® Binary data.

GH_IO.Serialization.GH_Archive.GrasshopperXmlExtension
Gets the file extension (including the dot) associated with Grasshopper® XML data.

GH_IO.Serialization.GH_Archive.GrasshopperUserExtension
Gets the file extension (including the dot) associated with Grasshopper® User Object file.

GH_IO.Serialization.GH_Archive.GH_IO_Version
Gets the version number of the current GH_IO build.

GH_IO.Serialization.GH_Archive.Messages
Gets the internal list of messages.

GH_IO.Serialization.GH_Archive.WorstCaseMessageType
Gets the worst case message type.
If the record contains at least 1 error, the worst case is GH_Message_Type.error.
If the record contains no errors, but at least 1 warning,
the worst case is GH_Message_Type.warning.
If the record contains no messages or only infos, the worst case type is GH_Message_Type.info.

GH_IO.Serialization.GH_Archive.GetRootNode
Gets the root node of this archive.
Typically you do not need to modify the Root.
Use functions like CreateTopLevelNode(), AppendObject() and ExtractObject() instead.
If you modify the Root node, you may corrupt the archive.

GH_IO.Serialization.GH_Archive.Path
Gets the path to the file from which this archive was read and/or written to.
If the archive hasn't been read or written yet, this field will be null.

GH_IO.Serialization.GH_Archive.IsPath
Gets a value that indicates whether or not the path field has been set.

GH_IO.Serialization.GH_Archive.IsBinaryPath
Gets a value that indicates whether the Path field points to a Binary Grasshopper file.

GH_IO.Serialization.GH_Archive.IsXmlPath
Gets a value that indicates whether the Path field points to an Xml Grasshopper file.

GH_IO.Serialization.GH_Archive.FileName
Gets the filename (without extension) of the currently loaded data tree.
If the path field has not been set, "unnamed" is returned.