GH_IO.Serialization.GH_IReader
Provides access to a subset of GH_Chunk methods used for reading archives.

GH_IO.Serialization.GH_IReader.FindChunk(System.String)
Finds the first chunk in the litter that matches the given name.
Only chunks without index qualifiers are considered.
name: Name of chunk to search for.
Returns: The child chunk that matches the given name,
or null of no matching chunk could be found.

GH_IO.Serialization.GH_IReader.FindChunk(System.String,System.Int32)
Finds the first chunk in the list that matches the given name and index.
Only chunks with index qualifiers are considered.
name: Name of chunk to search for.
index: Index of chunk to search for.
If less than zero, FindChunk(string chunk_name) is called instead.
Returns: The child chunk that matches the given name and index,
or null of no matching chunk could be found.

GH_IO.Serialization.GH_IReader.ChunkExists(System.String)
Checks whether a chunk with the specified name exists in the litter.
Only chunks without index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of chunk to test for.
Returns: True if a chunk with the specified name exists, otherwise false.

GH_IO.Serialization.GH_IReader.ChunkExists(System.String,System.Int32)
Checks whether a chunk with the specified name and index exists in the litter.
Only chunks with index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of chunk to test for.
index: Index of chunk to test for.
If less than zero, ChunkExists(string chunk_name) is called instead.
Returns: True if a chunk with the specified name and index exists, otherwise false.

GH_IO.Serialization.GH_IReader.FindItem(System.String)
Finds the first item that matches the given name.
Only items without index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of item to search for.
Returns: The item that matches the given name,
or null of no matching item could be found.

GH_IO.Serialization.GH_IReader.FindItem(System.String,System.Int32)
Finds the first item that matches the given name and index.
Only items with index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of item to search for.
index: Index of item to search for.
If less than zero, then FindItem(string name) is called instead.
Returns: The item that matches the given name and index,
or null of no matching item could be found.

GH_IO.Serialization.GH_IReader.ItemExists(System.String)
Checks whether an item with the specified name exists.
Only items without index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of item to test for.
Returns: True if an item with the specified name exists, otherwise false.

GH_IO.Serialization.GH_IReader.ItemExists(System.String,System.Int32)
Checks whether an item with the specified name and index exists.
Only items with index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of item to test for.
index: Index of item to test for.
If index is less than zero, then ItemExists(string name) is called instead.
Returns: True if an item with the specified name and index exists, otherwise false.

GH_IO.Serialization.GH_IReader.GetBoolean(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetBoolean(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetByte(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetByte(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetInt32(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetInt32(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetInt64(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetInt64(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetSingle(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetSingle(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDouble(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDouble(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDecimal(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDecimal(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDate(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDate(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetGuid(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetGuid(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetString(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetString(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingPoint(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingPoint(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingPointF(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingPointF(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingSize(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingSize(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingSizeF(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingSizeF(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingRectangle(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingRectangle(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingRectangleF(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingRectangleF(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingColor(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingColor(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingBitmap(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetDrawingBitmap(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetByteArray(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetByteArray(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetPoint2D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetPoint2D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetPoint3D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetPoint3D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetPoint4D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetPoint4D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetInterval1D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetInterval1D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetInterval2D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetInterval2D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetLine(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetLine(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetBoundingBox(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetBoundingBox(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetPlane(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetPlane(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.GetVersion(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_IReader.GetVersion(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_IReader.TryGetBoolean(System.String,System.Boolean@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetBoolean(System.String,System.Int32,System.Boolean@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetByte(System.String,System.Byte@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetByte(System.String,System.Int32,System.Byte@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetInt32(System.String,System.Int32@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetInt32(System.String,System.Int32,System.Int32@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetInt64(System.String,System.Int64@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetInt64(System.String,System.Int32,System.Int64@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetSingle(System.String,System.Single@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetSingle(System.String,System.Int32,System.Single@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDouble(System.String,System.Double@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDouble(System.String,System.Int32,System.Double@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDecimal(System.String,System.Decimal@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDecimal(System.String,System.Int32,System.Decimal@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDate(System.String,System.DateTime@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDate(System.String,System.Int32,System.DateTime@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetGuid(System.String,System.Guid@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetGuid(System.String,System.Int32,System.Guid@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetString(System.String,System.String@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetString(System.String,System.Int32,System.String@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingPoint(System.String,System.Drawing.Point@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingPoint(System.String,System.Int32,System.Drawing.Point@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingPointF(System.String,System.Drawing.PointF@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingPointF(System.String,System.Int32,System.Drawing.PointF@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingSize(System.String,System.Drawing.Size@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingSize(System.String,System.Int32,System.Drawing.Size@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingSizeF(System.String,System.Drawing.SizeF@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingSizeF(System.String,System.Int32,System.Drawing.SizeF@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingRectangle(System.String,System.Drawing.Rectangle@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingRectangle(System.String,System.Int32,System.Drawing.Rectangle@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingRectangleF(System.String,System.Drawing.RectangleF@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingRectangleF(System.String,System.Int32,System.Drawing.RectangleF@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingColor(System.String,System.Drawing.Color@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetDrawingColor(System.String,System.Int32,System.Drawing.Color@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetPoint2D(System.String,GH_IO.Types.GH_Point2D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetPoint2D(System.String,System.Int32,GH_IO.Types.GH_Point2D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetPoint3D(System.String,GH_IO.Types.GH_Point3D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetPoint3D(System.String,System.Int32,GH_IO.Types.GH_Point3D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetPoint4D(System.String,GH_IO.Types.GH_Point4D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetPoint4D(System.String,System.Int32,GH_IO.Types.GH_Point4D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetInterval1D(System.String,GH_IO.Types.GH_Interval1D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetInterval1D(System.String,System.Int32,GH_IO.Types.GH_Interval1D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetInterval2D(System.String,GH_IO.Types.GH_Interval2D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetInterval2D(System.String,System.Int32,GH_IO.Types.GH_Interval2D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetLine(System.String,GH_IO.Types.GH_Line@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetLine(System.String,System.Int32,GH_IO.Types.GH_Line@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetBoundingBox(System.String,GH_IO.Types.GH_BoundingBox@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetBoundingBox(System.String,System.Int32,GH_IO.Types.GH_BoundingBox@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetPlane(System.String,GH_IO.Types.GH_Plane@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetPlane(System.String,System.Int32,GH_IO.Types.GH_Plane@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetVersion(System.String,GH_IO.Types.GH_Version@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_IReader.TryGetVersion(System.String,System.Int32,GH_IO.Types.GH_Version@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.