GH_IO.Serialization.GH_Chunk
Full implementation of GH_IChunk, GH_IReader, GH_IWriter, GH_IBinarySupport and GH_IXmlSupport.
Instances of this class are usually disguised as one of the interfaces it implements.

GH_IO.Serialization.GH_Chunk.#ctor
Blank constructor. You typically do not need to create your own Chunks. The GH_Archive class
will create top-level chunks and existing chunks can create child chunks.

GH_IO.Serialization.GH_Chunk.#ctor(GH_IO.Serialization.GH_Archive)
Constructor. You typically do not need to create your own Chunks. The GH_Archive class
will create top-level chunks and existing chunks can create child chunks.
chunk_archive: Owner archive.

GH_IO.Serialization.GH_Chunk.#ctor(GH_IO.Serialization.GH_Archive,System.String)
Constructor. You typically do not need to create your own Chunks. The GH_Archive class
will create top-level chunks and existing chunks can create child chunks.
chunk_archive: Owner archive.
chunk_name: Name of this chunk.

GH_IO.Serialization.GH_Chunk.#ctor(GH_IO.Serialization.GH_Archive,System.String,System.Int32)
Constructor. You typically do not need to create your own Chunks. The GH_Archive class
will create top-level chunks and existing chunks can create child chunks.
chunk_archive: Owner archive.
chunk_name: Name of this chunk.
chunk_index: Index of this chunk.

GH_IO.Serialization.GH_Chunk.InstantiateRoot(GH_IO.Serialization.GH_Archive)
Construct a new instance of GH_Chunk which acts as a Root node. If you must
create a chunk from scratch, use this static method to create one.
owner: The archive which owns this chunk.
Throws System.ArgumentNullException: Thrown when the owner is a null reference.

GH_IO.Serialization.GH_Chunk.AddMessage(System.String,GH_IO.Serialization.GH_Message_Type)
Log a new message with the top-level archive.
Messages are collected during read/write operations,
and can be displayed to the user upon completion using GH_Archive.ShowMessageLog().
m: Message text.
t: Message type.
Throws System.ArgumentNullException: Thrown if message text is null or empty.

GH_IO.Serialization.GH_Chunk.m_name
Name of this chunk. This field is set only once, during construction.

GH_IO.Serialization.GH_Chunk.m_index
Index of this chunk. This field is set only once, during construction.
A negative index indicates no index qualifier has been set.

GH_IO.Serialization.GH_Chunk.m_comments
List of text comments. This list is automatically instantiated once the first comment is added.

GH_IO.Serialization.GH_Chunk.m_archive
Pointer to the archive that owns the Root of the tree this chunk belongs to.

GH_IO.Serialization.GH_Chunk.AddComment(System.String)
Adds a text comment to this chunk. Comments are serialized only if the output flavour is a
human readable format. Comments are never deserialized, they are purely for the benefit of the
humans reading the file data.
comment_text: The content of the comment,
text might be altered if it contains invalid characters for a chosen format flavour.
Throws System.ArgumentNullException: Thrown if the content text is either null or empty.

GH_IO.Serialization.GH_Chunk.name_comp
Comparison flag to use when comparing names.

GH_IO.Serialization.GH_Chunk.m_items
The list of nodes contained within this chunk.

GH_IO.Serialization.GH_Chunk.FindItem(System.String)
Finds the first item that matches the given name.
Only items without index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of item to search for.
Returns: The item that matches the given name,
or null of no matching item could be found.

GH_IO.Serialization.GH_Chunk.FindItem(System.String,System.Int32)
Finds the first item that matches the given name and index.
Only items with index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of item to search for.
index: Index of item to search for.
If less than zero, then FindItem(string name) is called instead.
Returns: The item that matches the given name and index,
or null of no matching item could be found.

GH_IO.Serialization.GH_Chunk.ItemExists(System.String)
Gets the occupancy for a specific item name. Only items without index qualifiers are considered.
name: Name of item to check for.
Returns: True if an item with a similar name already exists, false if not.

GH_IO.Serialization.GH_Chunk.ItemExists(System.String,System.Int32)
Checks whether an item with the specified name and index exists.
Only items with index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of item to test for.
index: Index of item to test for.
If index is less than zero, then ItemExists(string name) is called instead.
Returns: True if an item with the specified name and index exists, otherwise false.

GH_IO.Serialization.GH_Chunk.m_chunks
List of sub-chunks contained within this chunk.

GH_IO.Serialization.GH_Chunk.FindChunk(System.String)
Finds the first chunk in the litter that matches the given name.
Only chunks without index qualifiers are considered.
name: Name of chunk to search for.
Returns: The child chunk that matches the given name,
or null of no matching chunk could be found.

GH_IO.Serialization.GH_Chunk.FindChunk(System.String,System.Int32)
Finds the first chunk in the list that matches the given name and index.
Only chunks with index qualifiers are considered.
name: Name of chunk to search for.
index: Index of chunk to search for.
If less than zero, FindChunk(string chunk_name) is called instead.
Returns: The child chunk that matches the given name and index,
or null of no matching chunk could be found.

GH_IO.Serialization.GH_Chunk.ChunkExists(System.String)
Checks whether a chunk with the specified name exists in the litter.
Only chunks without index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of chunk to test for.
Returns: True if a chunk with the specified name exists, otherwise false.

GH_IO.Serialization.GH_Chunk.ChunkExists(System.String,System.Int32)
Checks whether a chunk with the specified name and index exists in the litter.
Only chunks with index qualifiers are considered.
Name comparisons are not case-sensitive.
name: Name of chunk to test for.
index: Index of chunk to test for.
If less than zero, ChunkExists(string name) is called instead.
Returns: True if a chunk with the specified name and index exists, otherwise false.

GH_IO.Serialization.GH_Chunk.CreateChunk(System.String)
Create a new child chunk with the specified name and without an index qualifier.
If another chunk already exists with similar properties, an exception will be thrown.
chunk_name: Name of new child.
Returns: The newly created child chunk.
Throws System.ArgumentException:
Thrown if the name+index coordinte is already occupied by another chunk.

GH_IO.Serialization.GH_Chunk.CreateChunk(System.String,System.Int32)
Create a new child chunk with the specified name and index qualifier.
If another chunk already exists with similar properties, an exception will be thrown.
chunk_name: Name of new child.
chunk_index: Index of new child.
Returns: The newly created child chunk.
Throws System.ArgumentException:
Thrown if the name+index coordinte is already occupied by another chunk.

GH_IO.Serialization.GH_Chunk.RemoveChunk(System.String)
Remove the first chunk with a matching name.
Only chunks without index qualifiers are considered.
Name comparisons are not case-sensitive.
chunk_name: Name of chunk to remove.
Returns: True is chunk was removed, false if no matching chunk could be found.

GH_IO.Serialization.GH_Chunk.RemoveChunk(System.String,System.Int32)
Remove the first chunk with a matching name and index.
Only chunks with index qualifiers are considered.
Name comparisons are not case-sensitive.
chunk_name: Name of chunk to remove.
chunk_index: Index of chunk to remove.
Returns: True is chunk was removed, false if no matching chunk could be found.

GH_IO.Serialization.GH_Chunk.RemoveChunk(GH_IO.Serialization.GH_IChunk)
Remove the specified chunk from the litter.
chunk: Chunk to remove.
Returns: True is chunk was removed, false if chunk is not part of this litter.
Throws System.ArgumentNullException: Thrown if chunk is a null reference.

GH_IO.Serialization.GH_Chunk.Write(System.IO.BinaryWriter)
Write this chunk and all child chunks to a binary stream.
writer: The Binary writer to use, cannot be null.
Throws System.MemberAccessException: Thrown if the name of this chunk is either null or empty.

GH_IO.Serialization.GH_Chunk.Read(System.IO.BinaryReader)
Read this chunk and all child chunks from a binary stream.
reader: The Binary reader to use, cannot be null.

GH_IO.Serialization.GH_Chunk.Write(System.Xml.XmlWriter)
Serialize this chunk into an Xml stream.
writer: Xml writer used for serialization.
Throws System.MemberAccessException: Thrown if

GH_IO.Serialization.GH_Chunk.Read(System.Xml.XmlNode)
Read this chunk and all child chunks from an Xml node.
node: The Xml node to deserialize from, cannot be null.

GH_IO.Serialization.GH_Chunk.SetBoolean(System.String,System.Boolean)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetBoolean(System.String,System.Int32,System.Boolean)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetByte(System.String,System.Byte)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetByte(System.String,System.Int32,System.Byte)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetInt32(System.String,System.Int32)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetInt32(System.String,System.Int32,System.Int32)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetInt64(System.String,System.Int64)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetInt64(System.String,System.Int32,System.Int64)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetSingle(System.String,System.Single)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetSingle(System.String,System.Int32,System.Single)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDouble(System.String,System.Double)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDouble(System.String,System.Int32,System.Double)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDecimal(System.String,System.Decimal)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDecimal(System.String,System.Int32,System.Decimal)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDate(System.String,System.DateTime)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDate(System.String,System.Int32,System.DateTime)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetGuid(System.String,System.Guid)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetGuid(System.String,System.Int32,System.Guid)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetString(System.String,System.String)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetString(System.String,System.Int32,System.String)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingPoint(System.String,System.Drawing.Point)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingPoint(System.String,System.Int32,System.Drawing.Point)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingPointF(System.String,System.Drawing.PointF)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingPointF(System.String,System.Int32,System.Drawing.PointF)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingSize(System.String,System.Drawing.Size)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingSize(System.String,System.Int32,System.Drawing.Size)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingSizeF(System.String,System.Drawing.SizeF)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingSizeF(System.String,System.Int32,System.Drawing.SizeF)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingRectangle(System.String,System.Drawing.Rectangle)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingRectangle(System.String,System.Int32,System.Drawing.Rectangle)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingRectangleF(System.String,System.Drawing.RectangleF)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingRectangleF(System.String,System.Int32,System.Drawing.RectangleF)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingColor(System.String,System.Drawing.Color)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingColor(System.String,System.Int32,System.Drawing.Color)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingBitmap(System.String,System.Drawing.Bitmap)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDrawingBitmap(System.String,System.Int32,System.Drawing.Bitmap)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetByteArray(System.String,System.Byte[])
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetByteArray(System.String,System.Int32,System.Byte[])
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetPoint2D(System.String,GH_IO.Types.GH_Point2D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetPoint2D(System.String,System.Int32,GH_IO.Types.GH_Point2D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetPoint3D(System.String,GH_IO.Types.GH_Point3D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetPoint3D(System.String,System.Int32,GH_IO.Types.GH_Point3D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetPoint4D(System.String,GH_IO.Types.GH_Point4D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetPoint4D(System.String,System.Int32,GH_IO.Types.GH_Point4D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetInterval1D(System.String,GH_IO.Types.GH_Interval1D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetInterval1D(System.String,System.Int32,GH_IO.Types.GH_Interval1D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetInterval2D(System.String,GH_IO.Types.GH_Interval2D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetInterval2D(System.String,System.Int32,GH_IO.Types.GH_Interval2D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetLine(System.String,GH_IO.Types.GH_Line)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetLine(System.String,System.Int32,GH_IO.Types.GH_Line)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetBoundingBox(System.String,GH_IO.Types.GH_BoundingBox)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetBoundingBox(System.String,System.Int32,GH_IO.Types.GH_BoundingBox)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetPlane(System.String,GH_IO.Types.GH_Plane)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetPlane(System.String,System.Int32,GH_IO.Types.GH_Plane)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetVersion(System.String,System.Int32,System.Int32,System.Int32)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
major: Major component of Version structure.
minor: Minor component of Version structure.
revision: Revision component of Version structure.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetVersion(System.String,System.Int32,System.Int32,System.Int32,System.Int32)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
major: Major component of Version structure.
minor: Minor component of Version structure.
revision: Revision component of Version structure.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetVersion(System.String,GH_IO.Types.GH_Version)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetVersion(System.String,System.Int32,GH_IO.Types.GH_Version)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.GetBoolean(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetBoolean(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetByte(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetByte(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetInt32(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetInt32(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetInt64(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetInt64(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetSingle(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetSingle(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDouble(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDouble(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDecimal(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDecimal(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDate(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDate(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetGuid(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetGuid(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetString(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetString(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingPoint(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingPoint(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingPointF(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingPointF(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingSize(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingSize(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingSizeF(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingSizeF(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingRectangle(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingRectangle(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingRectangleF(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingRectangleF(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingColor(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingColor(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingBitmap(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDrawingBitmap(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetByteArray(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetByteArray(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetPoint2D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetPoint2D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetPoint3D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetPoint3D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetPoint4D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetPoint4D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetInterval1D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetInterval1D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetInterval2D(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetInterval2D(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetLine(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetLine(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetBoundingBox(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetBoundingBox(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetPlane(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetPlane(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetVersion(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetVersion(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.TryGetBoolean(System.String,System.Boolean@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetBoolean(System.String,System.Int32,System.Boolean@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetByte(System.String,System.Byte@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetByte(System.String,System.Int32,System.Byte@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetInt32(System.String,System.Int32@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetInt32(System.String,System.Int32,System.Int32@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetInt64(System.String,System.Int64@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetInt64(System.String,System.Int32,System.Int64@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetSingle(System.String,System.Single@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetSingle(System.String,System.Int32,System.Single@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDouble(System.String,System.Double@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDouble(System.String,System.Int32,System.Double@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDecimal(System.String,System.Decimal@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDecimal(System.String,System.Int32,System.Decimal@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDate(System.String,System.DateTime@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDate(System.String,System.Int32,System.DateTime@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetGuid(System.String,System.Guid@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetGuid(System.String,System.Int32,System.Guid@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetString(System.String,System.String@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetString(System.String,System.Int32,System.String@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingPoint(System.String,System.Drawing.Point@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingPoint(System.String,System.Int32,System.Drawing.Point@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingPointF(System.String,System.Drawing.PointF@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingPointF(System.String,System.Int32,System.Drawing.PointF@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingSize(System.String,System.Drawing.Size@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingSize(System.String,System.Int32,System.Drawing.Size@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingSizeF(System.String,System.Drawing.SizeF@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingSizeF(System.String,System.Int32,System.Drawing.SizeF@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingRectangle(System.String,System.Drawing.Rectangle@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingRectangle(System.String,System.Int32,System.Drawing.Rectangle@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingRectangleF(System.String,System.Drawing.RectangleF@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingRectangleF(System.String,System.Int32,System.Drawing.RectangleF@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingColor(System.String,System.Drawing.Color@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetDrawingColor(System.String,System.Int32,System.Drawing.Color@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetPoint2D(System.String,GH_IO.Types.GH_Point2D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetPoint2D(System.String,System.Int32,GH_IO.Types.GH_Point2D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetPoint3D(System.String,GH_IO.Types.GH_Point3D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetPoint3D(System.String,System.Int32,GH_IO.Types.GH_Point3D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetPoint4D(System.String,GH_IO.Types.GH_Point4D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetPoint4D(System.String,System.Int32,GH_IO.Types.GH_Point4D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetInterval1D(System.String,GH_IO.Types.GH_Interval1D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetInterval1D(System.String,System.Int32,GH_IO.Types.GH_Interval1D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetInterval2D(System.String,GH_IO.Types.GH_Interval2D@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetInterval2D(System.String,System.Int32,GH_IO.Types.GH_Interval2D@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetLine(System.String,GH_IO.Types.GH_Line@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetLine(System.String,System.Int32,GH_IO.Types.GH_Line@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetBoundingBox(System.String,GH_IO.Types.GH_BoundingBox@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetBoundingBox(System.String,System.Int32,GH_IO.Types.GH_BoundingBox@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetPlane(System.String,GH_IO.Types.GH_Plane@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetPlane(System.String,System.Int32,GH_IO.Types.GH_Plane@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetVersion(System.String,GH_IO.Types.GH_Version@)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.TryGetVersion(System.String,System.Int32,GH_IO.Types.GH_Version@)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
value: Target of assignment.
Returns: True if the value was set.

GH_IO.Serialization.GH_Chunk.Archive
Gets a pointer to the archive that owns the Root of the tree this chunk belongs to.

GH_IO.Serialization.GH_Chunk.HasName
Gets the name validity of this item.
The item is considered to have an invalid name if string.IsNullOrEmpty(name)

GH_IO.Serialization.GH_Chunk.HasIndex
Gets the index existence implication. The item is considered to have an index qualifier
if the index value is larger than or equal to zero.

GH_IO.Serialization.GH_Chunk.HasComments
Gets a value that indicates whether or not comments have been stored in this chunk.

GH_IO.Serialization.GH_Chunk.Name
Gets the name of this chunk. The name is set by the owner of this chunk.
Names must be at least 1 character long.
The combination of name+index is always unique among a set of chunks in a single litter.

GH_IO.Serialization.GH_Chunk.Index
Gets the index of this chunk. The index is set by the owner of this chunk.
Indices smaller than zero imply no index has been set.
The combination of name+index is always unique among a set of chunks in the same litter.

GH_IO.Serialization.GH_Chunk.ItemCount
Gets the number of items contained in this chunk.

GH_IO.Serialization.GH_Chunk.Items
Gets a pointer to the internal list of items.
Do not access this list unless you know what you are doing.

GH_IO.Serialization.GH_Chunk.ChunkCount
Gets the number of child chunks contained in this chunk.
The set of all child chunks is referred to as a 'litter'.

GH_IO.Serialization.GH_Chunk.Chunks
Gets a pointer to the internal list of child chunks.
Do not access this list unless you know what you are doing.