GH_IO.Serialization.GH_IXmlSupport
Interface which declares all methods required for objects that
can be (de)serialized to and from an Xml archive.

GH_IO.Serialization.GH_IXmlSupport.Write(System.Xml.XmlWriter)
Called when an object is required to serialize itself.
writer: Writer object to be used for serialization.

GH_IO.Serialization.GH_IXmlSupport.Read(System.Xml.XmlNode)
Called when an object is required to deserialize itself.
node: Node object to be used for deserialization.