GH_IO.Serialization.GH_IChunk
Base interface for all Archive Chunks.

GH_IO.Serialization.GH_IChunk.AddMessage(System.String,GH_IO.Serialization.GH_Message_Type)
Log a new message with the top-level archive.
Messages are collected during read/write operations,
and can be displayed to the user upon completion using GH_Archive.ShowMessageLog().
m: Message text.
t: Message type.

GH_IO.Serialization.GH_IChunk.Archive
Gets a pointer to the archive that owns the Root of the tree this chunk belongs to.

GH_IO.Serialization.GH_IChunk.Name
Gets the name of this chunk. The name is set by the owner of this chunk.
Names must be at least 1 character long.
The combination of name+index is always unique among a set of chunks in a single litter.

GH_IO.Serialization.GH_IChunk.Index
Gets the index of this chunk. The index is set by the owner of this chunk.
Indices smaller than zero imply no index has been set.
The combination of name+index is always unique among a set of chunks in the same litter.

GH_IO.Serialization.GH_IChunk.ItemCount
Gets the number of items contained in this chunk.

GH_IO.Serialization.GH_IChunk.Items
Gets a pointer to the internal list of items.
Do not access this list unless you know what you are doing.

GH_IO.Serialization.GH_IChunk.ChunkCount
Gets the number of child chunks contained in this chunk.
The set of all child chunks is referred to as a 'litter'.

GH_IO.Serialization.GH_IChunk.Chunks
Gets a pointer to the internal list of child chunks.
Do not access this list unless you know what you are doing.