GH_IO.Types.GH_Point4D
Represents a 4D point coordinate with double precision floating point components.

GH_IO.Types.GH_Point4D.x
X coordinate of point.

GH_IO.Types.GH_Point4D.y
Y coordinate of point.

GH_IO.Types.GH_Point4D.z
Z coordinate of point.

GH_IO.Types.GH_Point4D.w
W coordinate of point.

GH_IO.Types.GH_Point4D.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructor.
nx: X coordinate of point.
ny: Y coordinate of point.
nz: Z coordinate of point.
nw: W coordinate of point.

GH_IO.Types.GH_Point4D.ToString
Converts this structure to a human-readable string.
Returns: A string representation of the four-dimenionsional point structure.