GH_IO.Serialization.GH_IWriter
Provides access to a subset of GH_Chunk methods used for writing archives.

GH_IO.Serialization.GH_IWriter.AddComment(System.String)
Adds a text comment to this chunk. Comments are serialized only if the output flavour is a
human readable format. Comments are never deserialized, they are purely for the benefit of the
humans reading the file data.
comment_text: The content of the comment,
text might be altered if it contains invalid characters for a chosen format flavour.
Throws System.ArgumentNullException: Thrown if the content text is either null or empty.

GH_IO.Serialization.GH_IWriter.CreateChunk(System.String)
Create a new child chunk with the specified name but without an index qualifier.
If another chunk already exists with similar properties, an exception will be thrown.
chunk_name: Name of new child chunk.
Throws System.ArgumentException:
Thrown if the name coordinte is already occupied by another chunk.

GH_IO.Serialization.GH_IWriter.CreateChunk(System.String,System.Int32)
Create a new child chunk with the specified name and index qualifier.
If another chunk already exists with similar properties, an exception will be thrown.
chunk_name: Name of new child.
chunk_index: Index of new child.
Throws System.ArgumentException:
Thrown if the name+index coordinte is already occupied by another chunk.

GH_IO.Serialization.GH_IWriter.RemoveChunk(System.String)
Remove the first chunk with a matching name.
Only chunks without index qualifiers are considered.
Name comparisons are not case-sensitive.
chunk_name: Name of chunk to remove.
Returns: True is chunk was removed, false if no matching chunk could be found.

GH_IO.Serialization.GH_IWriter.RemoveChunk(System.String,System.Int32)
Remove the first chunk with a matching name and index.
Only chunks with index qualifiers are considered.
Name comparisons are not case-sensitive.
chunk_name: Name of chunk to remove.
chunk_index: Index of chunk to remove.
Returns: True is chunk was removed, false if no matching chunk could be found.

GH_IO.Serialization.GH_IWriter.RemoveChunk(GH_IO.Serialization.GH_IChunk)
Remove the specified chunk from the litter.
chunk: Chunk to remove.
Returns: True is chunk was removed, false if chunk is not part of this litter.
Throws System.ArgumentNullException: Thrown if chunk is a null reference.

GH_IO.Serialization.GH_IWriter.SetBoolean(System.String,System.Boolean)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetBoolean(System.String,System.Int32,System.Boolean)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetByte(System.String,System.Byte)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetByte(System.String,System.Int32,System.Byte)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetInt32(System.String,System.Int32)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetInt32(System.String,System.Int32,System.Int32)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetInt64(System.String,System.Int64)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetInt64(System.String,System.Int32,System.Int64)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetSingle(System.String,System.Single)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetSingle(System.String,System.Int32,System.Single)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDouble(System.String,System.Double)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDouble(System.String,System.Int32,System.Double)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDecimal(System.String,System.Decimal)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDecimal(System.String,System.Int32,System.Decimal)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDate(System.String,System.DateTime)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDate(System.String,System.Int32,System.DateTime)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetGuid(System.String,System.Guid)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetGuid(System.String,System.Int32,System.Guid)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetString(System.String,System.String)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add. If a null String is supplied, a zero-length String will be serialized.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetString(System.String,System.Int32,System.String)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add. If a null String is supplied, a zero-length String will be serialized.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingPoint(System.String,System.Drawing.Point)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingPoint(System.String,System.Int32,System.Drawing.Point)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingPointF(System.String,System.Drawing.PointF)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingPointF(System.String,System.Int32,System.Drawing.PointF)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingSize(System.String,System.Drawing.Size)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingSize(System.String,System.Int32,System.Drawing.Size)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingSizeF(System.String,System.Drawing.SizeF)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingSizeF(System.String,System.Int32,System.Drawing.SizeF)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingRectangle(System.String,System.Drawing.Rectangle)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingRectangle(System.String,System.Int32,System.Drawing.Rectangle)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingRectangleF(System.String,System.Drawing.RectangleF)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingRectangleF(System.String,System.Int32,System.Drawing.RectangleF)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingColor(System.String,System.Drawing.Color)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingColor(System.String,System.Int32,System.Drawing.Color)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingBitmap(System.String,System.Drawing.Bitmap)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDrawingBitmap(System.String,System.Int32,System.Drawing.Bitmap)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetByteArray(System.String,System.Byte[])
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetByteArray(System.String,System.Int32,System.Byte[])
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetPoint2D(System.String,GH_IO.Types.GH_Point2D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetPoint2D(System.String,System.Int32,GH_IO.Types.GH_Point2D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetPoint3D(System.String,GH_IO.Types.GH_Point3D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetPoint3D(System.String,System.Int32,GH_IO.Types.GH_Point3D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetPoint4D(System.String,GH_IO.Types.GH_Point4D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetPoint4D(System.String,System.Int32,GH_IO.Types.GH_Point4D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetInterval1D(System.String,GH_IO.Types.GH_Interval1D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetInterval1D(System.String,System.Int32,GH_IO.Types.GH_Interval1D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetInterval2D(System.String,GH_IO.Types.GH_Interval2D)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetInterval2D(System.String,System.Int32,GH_IO.Types.GH_Interval2D)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetLine(System.String,GH_IO.Types.GH_Line)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetLine(System.String,System.Int32,GH_IO.Types.GH_Line)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetBoundingBox(System.String,GH_IO.Types.GH_BoundingBox)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetBoundingBox(System.String,System.Int32,GH_IO.Types.GH_BoundingBox)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetPlane(System.String,GH_IO.Types.GH_Plane)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetPlane(System.String,System.Int32,GH_IO.Types.GH_Plane)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetVersion(System.String,GH_IO.Types.GH_Version)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetVersion(System.String,System.Int32,GH_IO.Types.GH_Version)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetVersion(System.String,System.Int32,System.Int32,System.Int32)
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
major: Major component of version structure.
minor: Minor component of version structure.
revision: Revision component of version structure.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetVersion(System.String,System.Int32,System.Int32,System.Int32,System.Int32)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
major: Major component of version structure.
minor: Minor component of version structure.
revision: Revision component of version structure.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.