GH_IO.UserInterface.GH_ArchiveMessageViewer
Viewer/Browser that displays a list of archive messages.

GH_IO.UserInterface.GH_ArchiveMessageViewer.components
Required designer variable.

GH_IO.UserInterface.GH_ArchiveMessageViewer.Dispose(System.Boolean)
Clean up any resources being used.
disposing: true if managed resources should be disposed; otherwise, false.

GH_IO.UserInterface.GH_ArchiveMessageViewer.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.

GH_IO.UserInterface.GH_ArchiveMessageViewer.#ctor
Constructor.

GH_IO.UserInterface.GH_ArchiveMessageViewer.SetArchive(GH_IO.Serialization.GH_Archive)
Set a new archive. The messages in this archive will be displayed on the form.
nArchive: