GH_IO.Types.GH_BoundingBox
Represents a 3D bounding box, denoted by two points.

GH_IO.Types.GH_BoundingBox.Min
Minimum corner of box.

GH_IO.Types.GH_BoundingBox.Max
Maximum corner of box.

GH_IO.Types.GH_BoundingBox.#ctor(GH_IO.Types.GH_Point3D,GH_IO.Types.GH_Point3D)
Constructor.
nMin: Minimum corner of box.
nMax: Maximum corner of box.

GH_IO.Types.GH_BoundingBox.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Constructor.
Minx: X coordinate of minimum corner.
Miny: Y coordinate of minimum corner.
Minz: Z coordinate of minimum corner.
Maxx: X coordinate of maximum corner.
Maxy: Y coordinate of maximum corner.
Maxz: Z coordinate of maximum corner.

GH_IO.Types.GH_BoundingBox.ToString
Converts this structure to a human-readable string.
Returns: A string representation of the box structure.