GH_IO.Types.GH_Point3D
Represents a 3D point coordinate with double precision floating point components.

GH_IO.Types.GH_Point3D.x
X coordinate of point.

GH_IO.Types.GH_Point3D.y
Y coordinate of point.

GH_IO.Types.GH_Point3D.z
Z coordinate of point.

GH_IO.Types.GH_Point3D.#ctor(System.Double,System.Double,System.Double)
Constructor.
nx: X coordinate of point.
ny: Y coordinate of point.
nz: Z coordinate of point.

GH_IO.Types.GH_Point3D.ToString
Converts this structure to a human-readable string.
Returns: A string representation of the three-dimenionsional point structure.