GH_IO.Types.GH_Line
Represents a 3D line segment, denoted by start and endpoints.

GH_IO.Types.GH_Line.A
Start of line.

GH_IO.Types.GH_Line.B
End of line.

GH_IO.Types.GH_Line.#ctor(GH_IO.Types.GH_Point3D,GH_IO.Types.GH_Point3D)
Constructor.
nA: Start of line.
nB: End of line.

GH_IO.Types.GH_Line.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Constructor.
Ax: X coordinate of start point.
Ay: Y coordinate of start point.
Az: Z coordinate of start point.
Bx: X coordinate of end point.
By: Y coordinate of end point.
Bz: Z coordinate of end point.

GH_IO.Types.GH_Line.ToString
Converts this structure to a human-readable string.
Returns: A string representation of the line structure.