GH_IO.Types.GH_Version
Basic version type. Contains Major, Minor and Revision fields.

GH_IO.Types.GH_Version.major
Major component of version structure.

GH_IO.Types.GH_Version.minor
Minor component of version structure.

GH_IO.Types.GH_Version.revision
Revision component of version structure.

GH_IO.Types.GH_Version.#ctor(System.Int32,System.Int32,System.Int32)
Default constructor. Create a new version from specified fields.
v_major: Major component of version.
v_minor: Minor component of version.
v_revision: Revision component of version.

GH_IO.Types.GH_Version.#ctor(GH_IO.Types.GH_Version)
Copy constructor. Duplicate an existing version structure.
other: Version to duplicate.

GH_IO.Types.GH_Version.op_Equality(GH_IO.Types.GH_Version,GH_IO.Types.GH_Version)
Compares two version structures for equality.
A: Version to compare.
B: Version to compare with.
Returns: True if all version fields in A and B are equal.

GH_IO.Types.GH_Version.op_Inequality(GH_IO.Types.GH_Version,GH_IO.Types.GH_Version)
Compares two version structures for inequality.
A: Version to compare.
B: Version to compare with.
Returns: True if A is different from B.

GH_IO.Types.GH_Version.op_LessThan(GH_IO.Types.GH_Version,GH_IO.Types.GH_Version)
Compares versions for smaller than relationships.
A: Version to compare.
B: Version to compare with.
Returns: True if A represents an older version than B.

GH_IO.Types.GH_Version.op_LessThanOrEqual(GH_IO.Types.GH_Version,GH_IO.Types.GH_Version)
Compares versions for smaller than or equal to relationships.
A: Version to compare.
B: Version to compare with.
Returns: True if A is older than or equal to B.

GH_IO.Types.GH_Version.op_GreaterThan(GH_IO.Types.GH_Version,GH_IO.Types.GH_Version)
Compares versions for larger than relationships.
A: Version to compare.
B: Version to compare with.
Returns: True if A is newer than B.

GH_IO.Types.GH_Version.op_GreaterThanOrEqual(GH_IO.Types.GH_Version,GH_IO.Types.GH_Version)
Compares versions for larger than or equal to relationships.
A: Version to compare.
B: Version to compare with.
Returns: True if A is newer than or equal to B.

GH_IO.Types.GH_Version.ToString
Default formatter for Version data: M.m.RRRR
Revision section is padded with zeroes until it is at least 4 digits long.
Returns: A string represtation of the Version structure.

GH_IO.Types.GH_Version.GetHashCode
Returns the hash code for this instance.
Returns: A hash code for the current version object.

GH_IO.Types.GH_Version.Equals(System.Object)
Performs value equality comparison.
obj: Object to compare with.
If obj is a null reference or not a GH_Version instance, false is returned.
Returns: True if obj is a GH_Version instance which is equal to this one.