GH_IO.Types.GH_Interval1D
Represents two double precision floating point values.

GH_IO.Types.GH_Interval1D.a
Start of interval.

GH_IO.Types.GH_Interval1D.b
End of interval.

GH_IO.Types.GH_Interval1D.#ctor(System.Double,System.Double)
Constructor.
na: Start of interval.
nb: End of interval.

GH_IO.Types.GH_Interval1D.ToString
Converts this structure to a human-readable string.
Returns: A string representation of the Interval structure.