GH_IO.Types.GH_Plane
Represents a 3D plane system, defined by origin point and {X,Y} axis directions.

GH_IO.Types.GH_Plane.Origin
Origin point of plane.

GH_IO.Types.GH_Plane.XAxis
X axis vector of plane.

GH_IO.Types.GH_Plane.YAxis
Y axis vector of plane.

GH_IO.Types.GH_Plane.#ctor(GH_IO.Types.GH_Point3D,GH_IO.Types.GH_Point3D,GH_IO.Types.GH_Point3D)
Constructor.
nOrigin: Origin of plane.
nXAxis: X axis of plane.
nYAxis: Y axis of plane.

GH_IO.Types.GH_Plane.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Constructor.
Ox: X coordinate of plane origin.
Oy: Y coordinate of plane origin.
Oz: Z coordinate of plane origin.
Xx: X component of plane x axis.
Xy: Y component of plane x axis.
Xz: Z component of plane x axis.
Yx: X component of plane y axis.
Yy: Y component of plane y axis.
Yz: Z component of plane y axis.

GH_IO.Types.GH_Plane.ToString
Converts this structure to a human-readable string.
Returns: A string representation of the plane structure.