GH_IO.Types.GH_Point2D
Represents a 2D point coordinate with double precision floating point components.

GH_IO.Types.GH_Point2D.x
X coordinate of point.

GH_IO.Types.GH_Point2D.y
Y coordinate of point.

GH_IO.Types.GH_Point2D.#ctor(System.Double,System.Double)
Constructor.
nx: X coordinate of point.
ny: Y coordinate of point.

GH_IO.Types.GH_Point2D.ToString
Converts this structure to a human-readable string.
Returns: A string representation of the two-dimenionsional point structure.