GH_IO.Types.GH_Interval2D
Represents two double precision domains.

GH_IO.Types.GH_Interval2D.u
One dimensional component in U direction.

GH_IO.Types.GH_Interval2D.v
One dimensional component in V direction.

GH_IO.Types.GH_Interval2D.#ctor(GH_IO.Types.GH_Interval1D,GH_IO.Types.GH_Interval1D)
Constructor.
nu: Interval component in U direction.
nv: Interval component in V direction.

GH_IO.Types.GH_Interval2D.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructor.
nu0: Start of interval component in U direction.
nu1: End of interval component in U direction.
nv0: Start of interval component in V direction.
nv1: End of interval component in V direction.

GH_IO.Types.GH_Interval2D.ToString
Converts this structure to a human-readable string.
Returns: A string representation of the two-dimensional Interval structure.