GH_IO.Properties.Resources
A strongly-typed resource class, for looking up localized strings, etc.

GH_IO.Properties.Resources.ResourceManager
Returns the cached ResourceManager instance used by this class.

GH_IO.Properties.Resources.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.