GH_IO.Serialization.GH_LooseChunk
A utility class for creating partial archives.

GH_IO.Serialization.GH_LooseChunk.#ctor(System.String)
Create a new loose chunk. A loose chunk does not have an owner archive
and thus cannot store runtime messages.
chunk_name: Name of this chunk.

GH_IO.Serialization.GH_LooseChunk.Serialize_Binary
Serializes the data tree into a byte array.
Returns: An array of bytes representing the Loose chunk.
This sample shows how to create a new loose chunk and serialize some values.
public byte[] CreateBinary(string archive_name, string[] item_names, int[] item_values)
{
GH_LooseChunk chunk = new GH_LooseChunk(archive_name);
for (int i = 0; i < item_names.Length; i++)
{
chunk.SetInt32(item_names[i], i, item_values[i]);
}
return chunk.Serialize_Binary();
}

GH_IO.Serialization.GH_LooseChunk.Deserialize_Binary(System.Byte[])
Deserializes a byte array.
content: Byte array to deserialize.
Returns: True on success, false on failure.

GH_IO.Serialization.GH_LooseChunk.Serialize_Xml
Serializes the data tree into an Xml string.
Returns: A string containing the Xml content.
This sample shows how to create a new loose chunk and serialize some values.
public string CreateXML(string archive_name, string[] item_names, int[] item_values)
{
GH_LooseChunk chunk = new GH_LooseChunk(archive_name);
for (int i = 0; i < item_names.Length; i++)
{
chunk.SetInt32(item_names[i], i, item_values[i]);
}
return chunk.Serialize_Xml();
}

GH_IO.Serialization.GH_LooseChunk.Deserialize_Xml(System.String)
Deserializes an Xml string.
xml_content: Xml to deserialize.
Returns: True on success, false on failure.