GH_IO.Serialization.GH_Message
Represents an archive log message.
Messages are collected during read/write operations.

GH_IO.Serialization.GH_Message.#ctor
Fake constructor to avoid new instances being created by a PropertyGrid.

GH_IO.Serialization.GH_Message.#ctor(System.String)
Create a new message of type GH_Message_Type.info
message_content: Text content of message.

GH_IO.Serialization.GH_Message.#ctor(System.String,GH_IO.Serialization.GH_Message_Type)
Create a new message.
message_content: Text content of message.
message_type: Type of message, GH_Message_Type.unset is not a valid type.

GH_IO.Serialization.GH_Message.Message
Gets the text content of this message.

GH_IO.Serialization.GH_Message.Type
Gets the type of this message.