GH_IO.UserInterface.GH_DeveloperDetails
Constains a set of static fields and properties regarding
developer contact details.

GH_IO.UserInterface.GH_DeveloperDetails.m_developer_contact
Field containing the current developer contact.
By default, this field is set to DefaultDeveloperContact;

GH_IO.UserInterface.GH_DeveloperDetails.DefaultDeveloperContact
Gets the default developer contact details.

GH_IO.UserInterface.GH_DeveloperDetails.DeveloperContact
Gets or sets the local developer contact info (e-mail).
By default, the developer email is DefaultDeveloperContact;
This email address is used in the Message Report viewer when sending a support e-mail.