Grasshopper.Kernel.GH_ActiveObject.AddRuntimeMessage(Grasshopper.Kernel.GH_RuntimeMessageLevel,System.String)
Add a new message to this object. Valid message type flags are Warning and Error.
If the Message string is empty or zero-length no message is added.
type: Type of message. Only Warnings and Errors are recorded.
message: Content of message.

Grasshopper.Kernel.GH_ActiveObject.RuntimeMessageLog
Create a comprehensive list of all runtime messages recorded in this component and subcomponents.
Returns: A list of runtime message lines.

Grasshopper.Kernel.GH_ActiveObject.Menu_AppendWarningsAndErrors(System.Windows.Forms.ToolStripDropDown)
Append the default warnings and errors menu items.