Grasshopper.GUI.Script.GH_EditorCodeLine.Line
Gets or sets the line of code.

Grasshopper.GUI.Script.GH_EditorCodeLine.ReadOnly
Gets or sets the readonly state of the code.

Grasshopper.GUI.Script.GH_EditorCodeLine
Represents a single line of code in the GH_ScriptEditor window.