Grasshopper.Kernel.GH_Format.TreatAsCollection(System.Object)
This method is used in Scripting components to determine whether a certain class was
'intended' as a collection or as a single piece of data.
obj: Object to test.
Returns: True if we think the object was intended as a collection.

Grasshopper.Kernel.GH_Format.FormatKeys(System.Windows.Forms.Keys)
Format a keys enumeration as though it's a menu shortcut
keys: Key data to format