Grasshopper.GUI.Ribbon.GH_RibbonPanel.DesiredHeight(System.Int32)
Calculates the desired height of the panel based on a given height.
given_height: The supplied height.
Returns: The nearest desired height.
Remarks: The desired height is the nearest height that is comfortable for this panel.
"Comfortable" being defined as minimum wasted space in the layout.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.PanelBarFont
Returns the font which is used to draw the panel bar tag