Grasshopper.GUI.RemotePanel.GH_FrontEnd.Document
Gets or sets the Document that populated this frontend.

Grasshopper.GUI.RemotePanel.GH_FrontEnd.GroupBounds
Gets the area available for Group objects.

Grasshopper.GUI.RemotePanel.GH_FrontEnd.Layout_ByIndex
Layout for straight, index based stacks. Only call this function for
layout purposes when your group containers are completely messed up.
Always consider calling Layout_ByPosition instead since it is a non-destructive
layout logic which takes dragging into account.