Grasshopper.Kernel.Special.GH_ControlKnob.Minimum
Gets or sets the lowest value allowed in this dial.
If Limit == false, this property is ignored.

Grasshopper.Kernel.Special.GH_ControlKnob.Maximum
Gets or sets the highest value allowed in this dial.
If Limit == false, this property is ignored.

Grasshopper.Kernel.Special.GH_ControlKnob.Value
Gets or sets the value for this dial.

Grasshopper.Kernel.Special.GH_ControlKnob.Range
Gets or sets the difference a full turn of the dial makes.

Grasshopper.Kernel.Special.GH_ControlKnob.Decimals
Gets or sets how many decimals are allowed.

Grasshopper.Kernel.Special.GH_ControlKnob.Limit
Gets or sets whether the dial is limited.

Grasshopper.Kernel.Special.GH_ControlKnob.DisplayFormat
Gets or sets the display format for this knob.

Grasshopper.Kernel.Special.GH_ControlKnob.Angle
Compute the angle in radians of the dial (clockwise, starting at y-up)
for the current value.

Grasshopper.Kernel.Special.GH_ControlKnob.RepairValue
Apply rounding and limits to the value field.