Grasshopper.Kernel.Types.GH_Point.CreateFromPointObject(System.Guid)
Create a new point geometry instance based on point object ID
id: The identifier of the point object
Remarks: This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.