Grasshopper.GUI.Script.GH_EditorCodeLines.FirstMutableIndex
Gets the first mutable line of code.

Grasshopper.GUI.Script.GH_EditorCodeLines.GetMutableCodeBlock(System.Int32)
Get all the lines that belong to the Nth mutable code block.
index: Index of mutable code block to retrieve.
Returns: An array of source code lines or null if there is no Nth block.

Grasshopper.GUI.Script.GH_EditorCodeLines.StringSplit(System.String,System.String)
String split utility class.
delim:
stream:
Returns:
Remarks:

Grasshopper.GUI.Script.GH_EditorCodeLines
Represents a list of source code lines in a GH_ScriptEditor window.