Grasshopper.Kernel.GH_AutoSaveSettings.PerformAutosave(Grasshopper.Kernel.GH_AutoSaveTrigger)
Tests a given trigger to see if it allows an autosave operation.
trigger: Trigger to filter.
Returns: True if the trigger ought to start an AutoSave op.