Grasshopper.Kernel.GH_DocumentServer.AddDocument(System.String)
Add a new document to the global list. If there already is a document with the
given path, it will be made active.
filepath: Filepath to document.
Returns: The document that was added or activated, or null on failure.

Grasshopper.Kernel.GH_DocumentServer.AddNewDocument
Adds a new, blank document to the global list.
Returns: The document thaw was added.