Grasshopper.GUI.RemotePanel.GH_Node.OwnerID
Gets the ID of the owner object. If the RCP object has no owner,
this ID will be Guid.Empty.

Grasshopper.GUI.RemotePanel.GH_Node.Owner
Gets the IGH_DocumentObject instance that is tied to this RCP_Object.
This object is required for automatic Menu population.

Grasshopper.GUI.RemotePanel.GH_Node
Base class for GH_RCP UI objects. You must inherit from this class if you want to play in the Remote Control Panel.