Grasshopper.Kernel.GH_Convert.CommonObjectToByteArray(Rhino.Runtime.CommonObject)
Convert a RhinoCommon object into a compressed byte-array using
safe Rhino 4.0 OpenNurbs serialization.
data: Object to serialize.
Returns: A byte array representing the object or null on failure.

Grasshopper.Kernel.GH_Convert.ParseDate(System.String,System.DateTime@)
Attempts to parse a date/time representation.
str: String containing the suspected date and/or time.
destination: If the return value is True, this parameter will be set to the new datetime
Returns: True on success, false on failure