Grasshopper.Plugin.Commands.Run_GrasshopperSwarm
Run the _GrasshopperSwarm Command.
Returns: True on success, false on failure.

Grasshopper.Plugin.Commands.Run_GrasshopperAppStore
Run the _GrasshopperAppStoreTest command logic.