Grasshopper.Kernel.IGH_RCP_Aware.Publish(Grasshopper.GUI.RemotePanel.IGH_ParentControl)
Create a new proxy object which will become part of a Remote Panel.

Grasshopper.Kernel.IGH_RCP_Aware
Implement this interface if you want to become part of the RemoteControlPanel.