Grasshopper.Kernel.Special.GH_Cluster.m_document
Internal cluster document.

Grasshopper.Kernel.Special.GH_Cluster.Document
Gets the internal document for this cluster. Document might be null.

Grasshopper.Kernel.Special.GH_Cluster.UpdateDocument(Grasshopper.Kernel.GH_Document)
Update this cluster to use a new document.
Input and Output parameters will be maintained whenever possible.
This function is very low-level, if you're in doubt about whether to use it or not,
contact david@mcneel.com for further information.
document: New cluster document.