Grasshopper.My.Resources.Res_GUI.Pangrams
Looks up a localized string similar to The wizard quickly jinxed the gnomes before they vaporized.
The quick brown fox jumps over the lazy dog.
Pack my box with five dozen liquor jugs.
My faxed joke won a pager in the cable TV quiz show.
Amazingly few discotheques provide jukeboxes.
By Jove, my quick study of lexicography won a prize.
Sixty zippers were quickly picked from the woven jute bag.
Just keep examining every low bid quoted for zinc etchings.
Nechť již hříšné saxofony ďáblů rozzvučí síň úděsnými tóny waltzu, tanga a quickstepu.
[rest of string was truncated]";.