Grasshopper.Kernel.Data.GH_Pattern.FromString(System.String,System.String@)
Attempt to parse a Pattern string.
s_pat: String to parse.
msg: If this function fails, msg will contain a message describing the error.
Returns: True on success, false on failure.

Grasshopper.Kernel.Data.GH_Pattern.AppendElements(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Data.GH_PatternElement})
Append each element in a list to this pattern.
Element addition logic is applied to each individual item in the list.

Grasshopper.Kernel.Data.GH_Pattern.AppendElement(Grasshopper.Kernel.Data.GH_PatternElement)
Append a new pattern element to the pattern. Depending on the new element type
and the existing pattern, the element will either be merged with the
final segment or a new segment will be created.

Grasshopper.Kernel.Data.GH_Pattern.Match(Grasshopper.Kernel.Data.GH_Path)
Match this pattern against a path.
path: Path to match against.
Returns: True if the pattern matches the path.

Grasshopper.Kernel.Data.GH_Pattern.Match(Grasshopper.Kernel.Data.GH_Path,System.Int32,System.Int32)
Recursive Match finder.
path: Path to match against.
p_i: Index in path representing the current search offset.
s_i: Index of segment currently being matched.
Returns: True if this (and all recursive) segments match with the given path.

Grasshopper.Kernel.Data.GH_Pattern.FindNext(Grasshopper.Kernel.Data.GH_Path,System.Collections.Generic.List{Grasshopper.Kernel.Data.GH_PatternElement},System.Int32)
Searches the path (starting at p_i) for the next full occurance of the pattern segment.
path: Path to search.
S: Segment to match, must not contain any wildcards.
p_i: Start of search in Path

Grasshopper.Kernel.Data.GH_Pattern
Represents an entire path match pattern.