Grasshopper.Kernel.Data.GH_PatternElement.#ctor
You are not allowed to construct GH_PatternElement directly. Please use one of the
static (Shared in VB) constructors:
GH_PatternElement.WildCardElement()
GH_PatternElement.AnyDigitElement()
GH_PatternElement.NumberElement()
GH_PatternElement.RangeElement()
GH_PatternElement.GroupElement()

Grasshopper.Kernel.Data.GH_PatternElement.WildCardElement
Creates a new instance of GH_PatternElement with the WildCard flag.

Grasshopper.Kernel.Data.GH_PatternElement.AnyDigitElement
Creates a new instance of GH_PatternElement with the AnyDigit flag.

Grasshopper.Kernel.Data.GH_PatternElement.NumberElement(System.Int32,System.Boolean)
Creates a new instance of GH_PatternElement with the Number flag.
number: Number to match.
invert: If True, the match will be negative.

Grasshopper.Kernel.Data.GH_PatternElement.RangeElement(System.Int32,System.Int32,System.Boolean)
Creates a new instance of GH_PatternElement with the Number flag.
lower: Inclusive Lower limit of index range.
upper: Inclusive Upper limit of index range.
invert: If True, the match will be negative.

Grasshopper.Kernel.Data.GH_PatternElement.GroupElement(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Creates a new instance of GH_PatternElement with the Number flag.
numbers: Numbers to include in the match.
invert: If True, the match will be negative.

Grasshopper.Kernel.Data.GH_PatternElement.Tags
Gets the tags stored in this element. The tag layout depends on the Type of this element:
None = no tags;
Wildcards = no tags;
Digit = a single tag;
Range = two tags;
Group = any number of tags

Grasshopper.Kernel.Data.GH_PatternElement.Match(System.Int32)
Compare a single integer for matching validity.
index: Number to match against this pattern element.

Grasshopper.Kernel.Data.GH_PatternElement
A single element in a string of path matching comparisons.