Grasshopper.Kernel.GH_UpgradeUtil.SwapComponents(Grasshopper.Kernel.IGH_Component,System.Guid)
Replace an existing component with a different one. All parameters (input and output) will be migrated.
originalComponent: Component current in a GH_Document.
newComponentGuid: ComponentGuid of the component to add.
Returns: Component that was added.

Grasshopper.Kernel.GH_UpgradeUtil.SwapComponents(Grasshopper.Kernel.IGH_Component,Grasshopper.Kernel.IGH_Component)
Replace an existing component with a different one. All parameters (input and output) will be migrated.
originalComponent: Component current in a GH_Document.
upgradedComponent: Component to swap.
Returns: True on success, false on failure.