Grasshopper.Kernel.Data.GH_PatternType.None
Represents an invalid, default value.

Grasshopper.Kernel.Data.GH_PatternType.Number
Single number

Grasshopper.Kernel.Data.GH_PatternType.Range
A range of digits delimited by two extremes.

Grasshopper.Kernel.Data.GH_PatternType.Group
A collection of non-related Integers

Grasshopper.Kernel.Data.GH_PatternType.AnyDigit
Any single digit

Grasshopper.Kernel.Data.GH_PatternType.WildCard
Any (or no) collection of digits

Grasshopper.Kernel.Data.GH_PatternType
Represents all possible element types in a Path Pattern.