Grasshopper.Kernel.GH_MarkovChain.Level1_Patterns
Gets all level 1 patterns stored in this chain database.

Grasshopper.Kernel.GH_MarkovChain.Level2_Patterns
Gets all level 2 patterns stored in this chain database.

Grasshopper.Kernel.GH_MarkovChain.Level3_Patterns
Gets all level 3 patterns stored in this chain database.

Grasshopper.Kernel.GH_MarkovChain.AppendPattern(Grasshopper.Kernel.GH_MarkovPattern)
Append a new pattern to the database or grow a pattern which already exists.
pat: Pattern to incorporate.