Grasshopper.Instances.RcpDockBar
Gets the app-domain wide RCP dockbar instance.

Grasshopper.Instances.DocumentEditor
Gets or sets the DocumentEditor of Grasshopper.

Grasshopper.Instances.ShowBanner
Gets or sets a value indicating whether or not the banner will be displayed during the ComponentServer Loading process.