Grasshopper.Kernel.Special.GH_ControlKnobAttributes.TuningData.InitialValue
Stores the offset value at the start of tuning.

Grasshopper.Kernel.Special.GH_ControlKnobAttributes.TuningData.Track
Mouse location (in canvas coordinates) at previous tuning frame.

Grasshopper.Kernel.Special.GH_ControlKnobAttributes.TuningData.Angles
Tuning angles for each point in the track. Every entry represents a
positive (counter-clockwise) or negative (clockwise) difference from the previous position.

Grasshopper.Kernel.Special.GH_ControlKnobAttributes.TuningData.GrowTrack(System.Drawing.PointF,System.Drawing.PointF)
Grow the tuning track by one point and compute the angle.
point: Point (in canvas coordinates) to record.
center: Point (in canvas coordinates) for center of dial.

Grasshopper.Kernel.Special.GH_ControlKnobAttributes.TuningData.TotalTurns
Compute the total angle from zero to now.