Grasshopper.GUI.Ribbon.GH_RibbonTab.Owner
Gets or sets the owner control for this tab.
The GH_RibbonControl owner
Remarks: If you supply a NULL value, you cannot call any interface methods

Grasshopper.GUI.Ribbon.GH_RibbonTab.Name
The name as displayed on the Tab control