Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.GetPaletteStyle(Grasshopper.GUI.Canvas.GH_Palette,System.Boolean,System.Boolean,System.Boolean)
Static (Shared in VB) method for solving which palette style is implied by the properties.
palette: Palette hint.
selected: Specifies whether the selected flavour of a palette needs to be returned.
locked: If True, the returned palette style is always Locked.
hidden: If True, the returned palette style is always Hidden.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.GetPaletteStyle(Grasshopper.GUI.Canvas.GH_Palette,Grasshopper.Kernel.IGH_Attributes)
Static (Shared in VB) method for solving which palette style is implied by the properties.
palette: Palette hint.
attributes: Attributes to parse for style details.