Grasshopper.GUI.GH_GraphicsUtil.RenderHighlightBox(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32)
Render a typical blueish highlight rectangle
G: Graphics object to render with.
box: Dimensions of selection box.
cornerRadius: Radius (in pixels) of box corners, use zero or less to render crisp rectangles.

Grasshopper.GUI.GH_GraphicsUtil.RenderHighlightBox(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Boolean,System.Boolean)
Render a typical blueish highlight rectangle
G: Graphics object to render with.
box: Dimensions of selection box.
cornerRadius: Radius (in pixels) of box corners, use zero or less to render crisp rectangles.
drawFill: If true, the box fill have a blue background.
drawEdge: If true, the box will have a blue edge.

Grasshopper.GUI.GH_GraphicsUtil.RenderHighlightBox(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Drawing.Color,System.Drawing.Color)
Render a typical blueish highlight rectangle
G: Graphics object to render with.
box: Dimensions of selection box.
cornerRadius: Radius (in pixels) of box corners, use zero or less to render crisp rectangles.
fill: Fill colour
edge: Edge colour

Grasshopper.GUI.GH_GraphicsUtil.ForegroundColour(System.Drawing.Color,System.Int32)
Calculates a suitable foreground color. If the background
is lighter than 50%, the foreground will be darker, otherwise the foreground will be lighter.
Contrast: Contrast amount (in 0~255 range)
col: Foreground colour that works well on the given background colour.

Grasshopper.GUI.GH_GraphicsUtil.OffsetColour(System.Drawing.Color,System.Int32,System.Int32,System.Int32)
Add a fixed value to all the channels in a colour.
col: The colour to mutate
red_shift: Offset value for red channel (-255 ~ +255).
green_shift: Offset value for green channel (-255 ~ +255).
blue_shift: Offset value for blue channel (-255 ~ +255).
Returns: The offsetted colour.
Remarks: The alpha channel of the colour is not offset.

Grasshopper.GUI.GH_GraphicsUtil.Distance(System.Drawing.PointF,System.Drawing.PointF)
Compute the distance between two points.
A: First point.
B: Second point.

Grasshopper.GUI.GH_GraphicsUtil.DistanceS(System.Drawing.PointF,System.Drawing.PointF)
Compute the squared distance between two points.
A: First point.
B: Second point.

Grasshopper.GUI.GH_GraphicsUtil.EtchHorizontal(System.Drawing.Graphics,System.Single,System.Single,System.Single,System.Int32)
Draws an etched line segment.
G: Graphics object to draw with.
x0: x component of start point.
x1: x component of end point.
y: y component of line segment.
alpha: Alpha level of etched line.

Grasshopper.GUI.GH_GraphicsUtil.EtchHorizontal(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Draws an etched line segment.
G: Graphics object to draw with.
x0: x component of start point.
x1: x component of end point.
y: y component of line segment.
alphaLight: Alpha level of etched lit line.
alphaDark: Alpha level of etched shadow line.

Grasshopper.GUI.GH_GraphicsUtil.EtchFadingHorizontal(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Draw an etched line with fading on the extremes.
G: Graphics object to draw with.
x0: Left x coordinate of etch.
x1: Right x coordinate of etch.
y: Y coordinate of etch.
alphaLight: Transparancy of bright etch line.
alphaDark: Transparency of dark etch line.

Grasshopper.GUI.GH_GraphicsUtil.EtchVertical(System.Drawing.Graphics,System.Single,System.Single,System.Single,System.Int32)
Draws an etched line segment.
G: Graphics object to draw with.
x: x component of line segment.
y0: x component of start point.
y1: y component of end point.
alpha: Alpha level of etched line.

Grasshopper.GUI.GH_GraphicsUtil.EtchVertical(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32)
Draws an etched line segment.
G: Graphics object to draw with.
x: x component of line segment.
y0: x component of start point.
y1: y component of end point.
alpha: Alpha level of etched line.

Grasshopper.GUI.GH_GraphicsUtil.EtchFadingVertical(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Draw an etched line with fading on the extremes.
G: Graphics object to draw with.
y0: Top y coordinate of etch.
y1: Bottom y coordinate of etch.
x: X coordinate of etch.
alphaLight: Transparancy of etch.
alphaDark: Transparancy of etch.

Grasshopper.GUI.GH_GraphicsUtil.Grid(System.Drawing.Graphics,System.Drawing.RectangleF,System.Int32)
Draw a default grid.
G: Graphics object to draw with.
rec: Grid rectangle.
density: Density in both directions.

Grasshopper.GUI.GH_GraphicsUtil.Grid(System.Drawing.Graphics,System.Drawing.RectangleF,System.Int32,System.Int32)
Draw a default grid.
G: Graphics object to draw with.
rec: Grid rectangle.
density_x: Density in x direction.
density_y: Density in y direction.

Grasshopper.GUI.GH_GraphicsUtil.Grid(System.Drawing.Graphics,System.Drawing.RectangleF,System.Int32,System.Int32,System.Drawing.Color,System.Drawing.Color)
Draw a grid.
G: Graphics object to draw with.
rec: Grid rectangle.
density_x: Density in x direction.
density_y: Density in y direction.
color_bg: Background colour override, the default is 30/255 white.
color_wire: Grid line colour override, the default is 40/255 black.

Grasshopper.GUI.GH_GraphicsUtil.ShadowHorizontal(System.Drawing.Graphics,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Int32)
Draws a horizontal shadow edge.
G: Graphics object to draw with.
x0: Start of shadow edge.
x1: End of shadow edge.
y: Elevation of shadow edge.
size: Length of cast shadow.
below: If true, shadow is drawn below elevation line.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowHorizontal(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Int32)
Draws a horizontal shadow edge.
G: Graphics object to draw with.
x0: Start of shadow edge.
x1: End of shadow edge.
y: Elevation of shadow edge.
size: Length of cast shadow.
below: If true, shadow is drawn below elevation line.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowHorizontal(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Drawing.Color)
Draws a horizontal shadow edge.
G: Graphics object to draw with.
x0: Start of shadow edge.
x1: End of shadow edge.
y: Elevation of shadow edge.
size: Length of cast shadow.
below: If true, shadow is drawn below elevation line.
color: Colour at shadow edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowVertical(System.Drawing.Graphics,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Int32)
Draws a vertical shadow edge.
G: Graphics object to draw with.
x: Offset of shadow edge.
y0: Start of shadow edge.
y1: End of shadow edge.
size: Length of cast shadow.
right: If true, shadow is drawn to the right of the elevated line.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowVertical(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Int32)
Draws a vertical shadow edge.
G: Graphics object to draw with.
x: Offset of shadow edge.
y0: Start of shadow edge.
y1: End of shadow edge.
size: Length of cast shadow.
right: If true, shadow is drawn to the right of the elevated line.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowVertical(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Drawing.Color)
Draws a vertical shadow edge.
G: Graphics object to draw with.
x: Offset of shadow edge.
y0: Start of shadow edge.
y1: End of shadow edge.
size: Length of cast shadow.
right: If true, shadow is drawn to the right of the elevated line.
color: Color at shadow edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowRectangle(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Int32)
Draws shadow edges on the interior of a rectangle.
G: Graphics object to draw with.
rec: Bounding rectangle.
size: Length of cast shadow.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowRectangle(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Drawing.Color)
Draws shadow edges on the interior of a rectangle.
G: Graphics object to draw with.
rec: Bounding rectangle.
size: Length of cast shadow.
color: Color at edge of shadow.

Grasshopper.GUI.GH_GraphicsUtil.DentHorizontal(System.Drawing.Graphics,System.Drawing.Rectangle)
Draws a horizontal dent. A horizontal dent had dark lines along the top and bottom edges.
G: Graphics object to draw with.
box: Dimensions of the dent.

Grasshopper.GUI.GH_GraphicsUtil.DentHorizontal(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Int32)
Draws a horizontal dent. A horizontal dent had dark lines along the top and bottom edges.
G: Graphics object to draw with.
box: Dimensions of the dent.
alphaEdge: Transparency on the middle of the edges.
alphaFill: Transparency on the middle of the fill.

Grasshopper.GUI.GH_GraphicsUtil.DentVertical(System.Drawing.Graphics,System.Drawing.Rectangle)
Draws a vertical dent. A vertical dent had dark lines along the left and right edges.
G: Graphics object to draw with.
box: Dimensions of the dent.

Grasshopper.GUI.GH_GraphicsUtil.DentVertical(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Int32)
Draws a vertical dent. A vertical dent had dark lines along the left and right edges.
G: Graphics object to draw with.
box: Dimensions of the dent.
alphaEdge: Transparency on the middle of the edges.
alphaFill: Transparency on the middle of the fill.

Grasshopper.GUI.GH_GraphicsUtil.RenderVerticalString(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.RectangleF,System.Drawing.StringFormat)
Render vertical text (rotated 90 degrees counter-clockwise) within a rectangle.
G: Graphics object to draw with.
text: Text to render.
font: Font to render with.
colour: Colour of text content.
format: Formatting flags.

Grasshopper.GUI.GH_GraphicsUtil.RenderUnscaledIcon(System.Drawing.Graphics,System.Drawing.Image,System.Int32,System.Int32)
Draws an image file at 1:1 scale centered on the given coordinates.
G: Graphics object to draw with.
icon: Image to draw.
cx: X center of image in Graphics coordinate.
cy: Y center of image in Graphics coordinate.

Grasshopper.GUI.GH_GraphicsUtil.RenderUnscaledIcon(System.Drawing.Graphics,System.Drawing.Image,System.Int32,System.Int32,System.Double)
Draws an image file at 1:1 scale centered on the given coordinates.
G: Graphics object to draw with.
icon: Image to draw.
cx: X center of image in Graphics coordinate.
cy: Y center of image in Graphics coordinate.
fade: Alpha fading factor.

Grasshopper.GUI.GH_GraphicsUtil.RenderCenteredIcon(System.Drawing.Graphics,System.Drawing.RectangleF,System.Drawing.Image)
Draw an icon centered in a frame. This code is not zoom-aware, but it will
perform consistent rounding (to avoid  pixel-jitter when moving the frame across the screen).
Icon will not be clipped to the frame.
G: Graphics object to render with.
frame: Frame to center icon in.
icon: Icon to render

Grasshopper.GUI.GH_GraphicsUtil.RenderCenteredIcon(System.Drawing.Graphics,System.Drawing.RectangleF,System.Drawing.Image,System.Double)
Draw an icon centered in a frame. This code is not zoom-aware, but it will
perform consistent rounding (to avoid  pixel-jitter when moving the frame across the screen).
Icon will not be clipped to the frame.
G: Graphics object to render with.
frame: Frame to center icon in.
icon: Icon to render
alpha: Transparency factor.

Grasshopper.GUI.GH_GraphicsUtil.RenderColourIcon(System.Drawing.Graphics,System.Drawing.Rectangle,System.Drawing.Color)
Render a colour icon into a graphics context. A colour icon contains a black outer and white inner edge.
G: Graphics object to draw with.
rec: Rectangle describing icon dimensions.
colour: Colour for icon.

Grasshopper.GUI.GH_GraphicsUtil.RenderTag(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.Color,System.Drawing.RectangleF,System.Drawing.StringAlignment,System.Drawing.StringAlignment)
Render a text tag into a Graphics surface.
G: Graphics object to draw with.
tag: Text to draw.
font: Font to use.
back_color: Tag background colour.
fore_color: Tag foreground colour.
frame: The frame into which the tags should be aligned.
align_h: Horizontal alignment.
align_v: Vertical alignment.
This example shows how to render the 8 corner and edge tags into a rectangle:
Function RenderCornerAndEdgeTags(ByVal G As Graphics, ByVal frame As RectangleF)
Dim font As New Font("Courier New", 8)
Dim bg As Color = Color.White
Dim fg As Color = Color.Black
'Render the 4 corner tags
RenderTag(G, "UL", font, bg, fg, frame, StringAlignment.Near, StringAlignment.Near)
RenderTag(G, "UR", font, bg, fg, frame, StringAlignment.Far, StringAlignment.Near)
RenderTag(G, "LR", font, bg, fg, frame, StringAlignment.Far, StringAlignment.Far)
RenderTag(G, "LL", font, bg, fg, frame, StringAlignment.Near, StringAlignment.Far)
'Render the 4 edge tags
RenderTag(G, "T", font, bg, fg, frame, StringAlignment.Center, StringAlignment.Near)
RenderTag(G, "R", font, bg, fg, frame, StringAlignment.Far, StringAlignment.Center)
RenderTag(G, "B", font, bg, fg, frame, StringAlignment.Center, StringAlignment.Far)
RenderTag(G, "L", font, bg, fg, frame, StringAlignment.Near, StringAlignment.Center)
End Function

Grasshopper.GUI.GH_GraphicsUtil.RenderBalloonTag(System.Drawing.Graphics,System.String,System.Drawing.PointF,System.Drawing.RectangleF)
Draw a default balloon tag in a container.
G: Graphics object to draw with.
text: Text of tag.
tip: Tip of balloon.
container: Container for balloon.

Grasshopper.GUI.GH_GraphicsUtil.RenderBalloonTag(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.PointF,System.Drawing.RectangleF)
Draw a default balloon tag in a container with a Font override.
G: Graphics object to draw with.
text: Text of tag.
font: Font of tag.
tip: Tip of balloon.
container: Container for balloon.

Grasshopper.GUI.GH_GraphicsUtil.RenderBalloonTag(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.Color,System.Drawing.PointF,System.Drawing.RectangleF)
Draw a balloon tag in a container.
G: Graphics object to draw with.
text: Text of tag.
font: Font of tag.
back_color: Background colour of balloon.
fore_color: Foreground colout of balloon edge and text.
tip: Tip of balloon (should be inside container).
container: Container for balloon.

Grasshopper.GUI.GH_GraphicsUtil.RenderBalloonTag(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.Color,System.Drawing.PointF,System.Boolean)
Draw a balloon tag in a container.
G: Graphics object to draw with.
text: Text of tag.
font: Font of tag.
back_color: Background colour of balloon.
fore_color: Foreground colour of balloon edge and text.
tip: Tip of balloon.
upright: If true, the balloon will be above the tip point.

Grasshopper.GUI.GH_GraphicsUtil.RenderMeshToBitmap(System.Drawing.Size,System.Drawing.Color,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Mesh)
Render a mesh to a bitmap. DO NOT USE THIS METHOD.
size: Size of bitmap
back: Background colour of bitmap.
mesh: Mesh to draw.
Returns: A bitmap with the rendered result or null on error.