Grasshopper.GUI.RemotePanel.GH_Group.Name
Gets or sets the name of container.

Grasshopper.GUI.RemotePanel.GH_Group.Colour
Gets or sets the color of the container

Grasshopper.GUI.RemotePanel.GH_Group.BarArea
Gets the rectangle taken up by the entire container bar.

Grasshopper.GUI.RemotePanel.GH_Group.BarIconArea
Gets the rectangle taken up by the icon in the container bar.

Grasshopper.GUI.RemotePanel.GH_Group.BarTextArea
Gets the rectangle taken up by the title text in the container bar.

Grasshopper.GUI.RemotePanel.GH_Group.FoldOutArea
Gets the rectangle taken up by the part of the control that is not the title bar.
This is the part that disappears during collapsing. If the container is collapsed
then this area will have a height of zero.

Grasshopper.GUI.RemotePanel.GH_Group.ObjectArea
Gets the rectangle taken up by the content of this container.
The content area is what remains of the FoldOutArea after padding has been subtracted.

Grasshopper.GUI.RemotePanel.GH_Group.ObjectProximity(System.Drawing.Point,System.Double@,System.Int32@)
Finds the object inside this container closest to the test point.
pt: Point for proximity test.
distance: Distance from object to test point.
index: Index of object.

Grasshopper.GUI.RemotePanel.GH_Group
Represents a container for GH_Object instances.
Containers are top-level objects in the RCP.