Grasshopper.Kernel.GH_AssemblyFolderType.Core
The Core folder is the one where native Grasshopper GHA files are installed.

Grasshopper.Kernel.GH_AssemblyFolderType.Default
The Default folder is where Grasshopper puts 3rd party GHA files.

Grasshopper.Kernel.GH_AssemblyFolderType.RhiFolder
A RhiFolder folder is created by an RHI installer package.

Grasshopper.Kernel.GH_AssemblyFolderType.UserFolder
A UserFolder is created by the user via the _GrasshopperDeveloperSettings command.

Grasshopper.Kernel.GH_AssemblyFolderType
Enumerates the possible folder types for GH_AssemblyFolderInfo