Grasshopper.GUI.Ribbon.GH_Ribbon.AddLayout(System.String)
Add a new custom layout to the Ribbon. You must call PopulateRibbon when you're done
to make sure the new layout is constructed.
file: Layout to append, any existing layout with a similar name will be overwritten.

Grasshopper.GUI.Ribbon.GH_Ribbon.AddLayout(System.String,System.Boolean)
Add a new custom layout to the Ribbon. You must call PopulateRibbon when you're done
to make sure the new layout is constructed.
file: Layout to append, any existing layout with a similar name will be overwritten.

Grasshopper.GUI.Ribbon.GH_Ribbon.RemoveLayout(System.String)
Remove a given layout from the ribbon. You must call PopulateRibbon when you're done
to make sure the new layout is constructed.
file: File path of layout to remove.
Returns: True on success, false on failure.

Grasshopper.GUI.Ribbon.GH_Ribbon.RemoveAllLayouts
Remove all custom layouts from the ribbon. You must call PopulateRibbon(True) when you're done
to make sure the new layout is constructed.

Grasshopper.GUI.Ribbon.GH_Ribbon.ShowLayout(System.String)
Show a specific layout. You must call PopulateRibbon to see the changes.
path: Path of layout to show.

Grasshopper.GUI.Ribbon.GH_Ribbon.HideLayout(System.String)
Hide a specific layout. You must call PopulateRibbon to see the changes.
path: Path of layout to hide.

Grasshopper.GUI.Ribbon.GH_Ribbon.Layouts
Gets a list of all the custom layout file paths currently defined.

Grasshopper.GUI.Ribbon.GH_Ribbon.IsLayoutLoaded(System.String)
Test whether a layout file has been loaded by this Ribbon.
file: File path of layout.
Returns: True if layout is loaded, false if not.

Grasshopper.GUI.Ribbon.GH_Ribbon.IsLayoutVisible(System.String)
Test whether a layout file has been loaded and is visible in this Ribbon.
file: File path of layout.
Returns: True if layout is loaded and visible, false if not.