Grasshopper.Kernel.Geometry.Tree3d`1.Point3dConverter(Rhino.Geometry.Point3d,System.Double@,System.Double@,System.Double@)
Default implementation of converter for Rhino.Geometry.Point3d

Grasshopper.Kernel.Geometry.Tree3d`1.Point2dConverter(Rhino.Geometry.Point2d,System.Double@,System.Double@,System.Double@)
Default implementation of converter for Rhino.Geometry.Point3d

Grasshopper.Kernel.Geometry.Tree3d`1.Node3Converter(Grasshopper.Kernel.Geometry.Node3,System.Double@,System.Double@,System.Double@)
Default implementation of converter for Node3

Grasshopper.Kernel.Geometry.Tree3d`1.Node2Converter(Grasshopper.Kernel.Geometry.Node2,System.Double@,System.Double@,System.Double@)
Default implementation of converter for Node3

Grasshopper.Kernel.Geometry.Tree3d`1.#ctor(Grasshopper.Kernel.Geometry.Tree3d{`0}.CoordinatesOfT,Rhino.Geometry.BoundingBox)
Create a new tree within a box.

Grasshopper.Kernel.Geometry.Tree3d`1.#ctor(Grasshopper.Kernel.Geometry.Tree3d{`0}.CoordinatesOfT,Rhino.Geometry.BoundingBox,System.Int32)
Create a new tree within a box.

Grasshopper.Kernel.Geometry.Tree3d`1.Box
Gets the box that defines this tree.

Grasshopper.Kernel.Geometry.Tree3d`1.Mid
Gets the center point for this tree.

Grasshopper.Kernel.Geometry.Tree3d`1.Limit
Gets the subdivision limit.

Grasshopper.Kernel.Geometry.Tree3d`1.IsLeafNode
Gets whether this tree node is a final node.

Grasshopper.Kernel.Geometry.Tree3d`1.TwigCount
Gets the total number of twigs (sub-trees) for this tree.

Grasshopper.Kernel.Geometry.Tree3d`1.Twig(System.Int32)
Gets the twig (sub-tree) at the given index. Twigs may be null.
index: Index of twig to retrieve (0~7)

Grasshopper.Kernel.Geometry.Tree3d`1.AllElements
Gets all the points contained in this tree and any sub-trees.

Grasshopper.Kernel.Geometry.Tree3d`1.RecursiveAggregate(System.Collections.Generic.List{`0})
Recursively collect all points.
elements: All elements will be appended to this list.

Grasshopper.Kernel.Geometry.Tree3d`1.Elements
Gets the elements of this node. Do not modify this list unless you know what you are doing.

Grasshopper.Kernel.Geometry.Tree3d`1.TwigIndex(System.Double,System.Double,System.Double)
Gets the twig index that is associated with a given coordinate.
Returns: Index of twig that would contain the point.

Grasshopper.Kernel.Geometry.Tree3d`1.TwigVolume(System.Int32)
Gets the volume of a twig based on index.
index: Index of twig to compute.

Grasshopper.Kernel.Geometry.Tree3d`1.Insert(System.Collections.Generic.IEnumerable{`0})
Insert new elements into this tree structure.
elements: Elements to insert, should be within the tree bounding box.

Grasshopper.Kernel.Geometry.Tree3d`1.Insert(`0)
Insert a new element into this tree structure.
element: Element to insert, should be within the tree bounding box.

Grasshopper.Kernel.Geometry.Tree3d`1.SubDivide
Create brand new twigs and move all local points into the twigs.
This method destroys the local point list and any pre-existing twigs.
Remarks:

Grasshopper.Kernel.Geometry.Tree3d`1.Recreate
Aggregate all points in this (sub)tree and subdivide using the current Limit setting.

Grasshopper.Kernel.Geometry.Tree3d`1.NearestPoint(`0,System.Double@,`0@)
Find the nearest point in the tree.
locus: Point to search from.
distance: Distance to nearest point, or double.NaN if no nearest point can be found.
closestElement: Nearest point in tree, or Point3d.Unset if no nearest point can be found.

Grasshopper.Kernel.Geometry.Tree3d`1
Simple implementation of recursive OcTree.