Grasshopper.GUI.Base.GH_ColourSphere.m_map
Shared nistance of locked bitmap. Once created this is never released.

Grasshopper.GUI.Base.GH_ColourSphere.m_mapw
Scaling factor for map x sampling.

Grasshopper.GUI.Base.GH_ColourSphere.m_maph
Scaling factor for map y sampling.

Grasshopper.GUI.Base.GH_ColourSphere.m_colour
x = hue (0.0 ~ 2.0pi), y = lum (-0.5pi ~ +0.5pi), z = sat (0~1)

Grasshopper.GUI.Base.GH_ColourSphere.Bounds
Gets or sets the Dimensions of this sphere.

Grasshopper.GUI.Base.GH_ColourSphere.Content
Gets the rectangle that contains the sphere.

Grasshopper.GUI.Base.GH_ColourSphere.Radius
Gets the radius of the sphere as dictated by the current size.

Grasshopper.GUI.Base.GH_ColourSphere.ColourAt(System.Double,System.Double)
Gets the color at the given (normalised) {u,v} coordinate.
Coordinates are spherically cyclical.
u: U component of colour (hue).
v: V component of colour (lum).
Returns: Fully saturated colour at (u,v).

Grasshopper.GUI.Base.GH_ColourSphere.Mesh
Gets the mesh for the current setup.

Grasshopper.GUI.Base.GH_ColourSphere.RenderCircle(System.Drawing.Graphics,Rhino.Geometry.Circle,System.Drawing.Pen,System.Drawing.Pen)
Render a circle on the sphere.
G: Graphics object to draw with.
c: Circle to render.
p0: Pen to use for hidden portion of circle.
p1: Pen to use for visible portion of circle.

Grasshopper.GUI.Base.GH_ColourSphere.RenderArc(System.Drawing.Graphics,Rhino.Geometry.Arc,System.Drawing.Pen,System.Drawing.Pen)
Render an arc on the sphere.
G: Graphics object to draw with.
a: Arc to render.
p0: Pen to use for hidden portion of circle.
p1: Pen to use for visible portion of circle.

Grasshopper.GUI.Base.GH_ColourSphere.SplitCircle(Rhino.Geometry.Circle,Rhino.Geometry.Arc@,Rhino.Geometry.Arc@)
Split a circle with the world XY plane.
c: Circle to split.
c0: Part of circle below the XY plane.
c1: Part of circle above the XY plane.
Returns: True on success, false on failure.

Grasshopper.GUI.Base.GH_ColourSphere.SplitArc(Rhino.Geometry.Arc,System.Boolean)
Split an arc with the world XY plane.
a: Arc to split.
below: If True, those segments below the XY plane are returned.
Returns: All segments either below or above the XY plane.

Grasshopper.GUI.Base.GH_ColourSphere.PointToControl(Rhino.Geometry.Point3d)
Convert a 3D world coordinate into control-coordinates.

Grasshopper.GUI.Base.GH_ColourSphere.PointToWorld(System.Drawing.PointF)
Convert a control coordinate into a 3D world coordinate.

Grasshopper.GUI.Base.GH_ColourSphere.GripShape(System.Drawing.PointF,System.Single)
Computes the shape of the grip.
pt: Centerpoint of grip.
radius: Radius of grip.
Returns: Shape of grip.