Grasshopper.Kernel.Special.GH_Panel.ItemAlignment
Gets or sets the String alignment for loose items in the Text Panel.

Grasshopper.Kernel.Special.GH_Panel.ItemWrap
Gets or sets whether items are wrapped or trimmed.

Grasshopper.Kernel.Special.GH_Panel.MultilineData
Gets the sets the usertext multiline parsing option.
If false, every new line in the panel results in a new string item in the
volatile data.

Grasshopper.Kernel.Special.GH_Panel.DrawPaths
Gets or sets a value indicating whether or not Branch Paths should be included in the display.

Grasshopper.Kernel.Special.GH_Panel.DrawIndices
Gets or sets whether item indices are included in the panel.

Grasshopper.Kernel.Special.GH_Panel.Font
Gets or sets the font for this panel.