Grasshopper.GUI.RemotePanel.GH_Index.Container
Gets or sets the index of the container for this object.

Grasshopper.GUI.RemotePanel.GH_Index.Object
Gets or sets the index of this object in the container.

Grasshopper.GUI.RemotePanel.GH_Index
Contains the indices needed to identify a node inside a container.