Grasshopper.Kernel.GH_ComponentServer.CopyFileToRoamingFolder(System.String,System.Boolean)
Copy a GHA or GHUSER file into the appropriate Roaming Application Data folder.
Of the file is already in the top-level roaming folder it will not be copied.
filepath: The file to copy.
moveOriginalToBin: If true, the original file will be placed in the recycle bin upon a successful copy.
Returns: The path of the copied file.

Grasshopper.Kernel.GH_ComponentServer.IsValidGHA(System.Reflection.Assembly)
Tests to see if an Assembly references a newer version of Grasshopper.
A: Assembly to test
Returns: True if the assembly was build against the current or an
older version of Grasshopper.