Grasshopper.Kernel.GH_AuthorDetails.IsEmpty
Gets whether any of the fields have been assigned.

Grasshopper.Kernel.GH_AuthorDetails.Clear
Erase all fields.

Grasshopper.Kernel.GH_AuthorDetails
Maintains author information such as name, company, copyright, address etc.