Grasshopper.Kernel.Special.GH_NumberSlider.Slider
Gets the internal slider instance.

Grasshopper.Kernel.Special.GH_NumberSlider.SetSliderValue(System.Decimal,System.Boolean)
Sets member value directly.
val: Value to set
growDomain: If true, domain value will be adjusted to include the new value

Grasshopper.Kernel.Special.GH_NumberSlider.SetSliderValue(System.Decimal,System.Boolean,System.Boolean)
Sets member value directly.
val: Value to set
growDomain: If true, domain value will be adjusted to include the new value
recompute: If true, a new solution will be started immediately.
If recompute=False then you must start a new Solution soon.

Grasshopper.Kernel.Special.GH_NumberSlider.FormatNumber(System.Double,Grasshopper.GUI.Base.GH_SliderAccuracy,System.Int32)
Convert a double precision floating point number into a string, using the rounding rules as indicated.
value: Number to munge.
accuracy: Rounding algorithm to use.
digits: Number of digits, only applies for FloatingPoint rounding.