Grasshopper.CentralSettings.FormatENotationUpperThreshold
Gets or sets at what upper threshold decimal formatting of number becomes switches to E-Notation.

Grasshopper.CentralSettings.FormatENotationLowerThreshold
Gets or sets at what lower threshold decimal formatting of number becomes switches to E-Notation.

Grasshopper.CentralSettings.FormatENotationDigits
Gets or sets how many digits ought to be used for e-notation formatted numbers.

Grasshopper.CentralSettings.FormatAssumeIntegers
Gets or sets whether floating point numbers close to whole integers should be special cased.