Grasshopper.Kernel.Special.GH_ValueListAttributes.Button0
Gets the button rectangle along the right edge of the control.

Grasshopper.Kernel.Special.GH_ValueListAttributes.Button1
Gets the button rectangle to the left of Button0.