Grasshopper.Kernel.Geometry.Tree3dIndex`1.Index
Gets or sets the element index within the final branch.

Grasshopper.Kernel.Geometry.Tree3dIndex`1.Node
Gets the branch index collection.

Grasshopper.Kernel.Geometry.Tree3dIndex`1.Item
Gets the item at the given tree index.

Grasshopper.Kernel.Geometry.Tree3dIndex`1.DeleteItem
Removes the item from the tree.

Grasshopper.Kernel.Geometry.Tree3dIndex`1
Represents an element index within a Tree3d instance.