Grasshopper.Kernel.GH_RcpGroup.Name
Gets or sets the name of the group.

Grasshopper.Kernel.GH_RcpGroup.Colour
Gets or sets the colour of the group.

Grasshopper.Kernel.GH_RcpGroup.Collapsed
Gets or sets the collapsed state of the group.

Grasshopper.Kernel.GH_RcpGroup.Bounds
Gets or sets the bounds of the group.

Grasshopper.Kernel.GH_RcpGroup.ItemCount
Gets the number of items contained in this group.

Grasshopper.Kernel.GH_RcpGroup.Items
Gets the list of items contained in this group.

Grasshopper.Kernel.GH_RcpGroup
Represents a single panel in the Remote Control.