Grasshopper.GUI.RemotePanel.GH_Element.FrontEnd
Gets the frontend object that owns this object.

Grasshopper.GUI.RemotePanel.GH_Element.X
Gets or sets the x component of the pivot.

Grasshopper.GUI.RemotePanel.GH_Element.Y
Gets or sets the y component of the pivot.

Grasshopper.GUI.RemotePanel.GH_Element.Width
Gets or sets the width of the size.

Grasshopper.GUI.RemotePanel.GH_Element.Height
Gets or sets the height of the size

Grasshopper.GUI.RemotePanel.GH_Element.Margin
Gets or sets the marginal padding of the object.
This only affects how objects are nested.

Grasshopper.GUI.RemotePanel.GH_Element.Area
Gets or sets the dimensions of the object including the margins.

Grasshopper.GUI.RemotePanel.GH_Element.ClientArea
Gets the area taken up by the object without the margins.

Grasshopper.GUI.RemotePanel.GH_Element.Contains(System.Drawing.Point)
Test a point for object inclusion.
The default implementation ignores the area taken up by the margins.

Grasshopper.GUI.RemotePanel.GH_Element.DesiredWidth
Given the current settings, returns the width this object would like to have.

Grasshopper.GUI.RemotePanel.GH_Element.DesiredHeight
Given the current settings, returns the height this object would like to have.

Grasshopper.GUI.RemotePanel.GH_Element.DisplayExpired
Raised when the display of the object has changed. This
will trigger a redraw (but no layout) of the parent control.

Grasshopper.GUI.RemotePanel.GH_Element.OnDisplayExpired
Raise the DisplayExpired event.

Grasshopper.GUI.RemotePanel.GH_Element.LayoutExpired
Raised when the layout of this object has changed.

Grasshopper.GUI.RemotePanel.GH_Element.OnLayoutExpired
Raise the LayoutExpired event.

Grasshopper.GUI.RemotePanel.GH_Element.Render(System.Drawing.Graphics)
Render this object onto a Graphic surface using the current layout data.

Grasshopper.GUI.RemotePanel.GH_Element.RenderDefaultEditModeOverlay(System.Drawing.Graphics)
Call this function if you want to draw the default overlay for EditMode=True.

Grasshopper.GUI.RemotePanel.GH_Element
Base class for GH_RCP UI objects. You must inherit from this class if you want to play in the Remote Control Panel.