Grasshopper.GUI.Canvas.GH_Skin.canvas_hash0
Specifies the background colour of the canvas hatch pattern.

Grasshopper.GUI.Canvas.GH_Skin.canvas_hash1
Specifies the foreground colour of the canvas hatch pattern.

Grasshopper.GUI.Canvas.GH_Skin.palette_hidden_standard
Hidden, unselected palette. Default background for hidden (preview=off) parameters and components.

Grasshopper.GUI.Canvas.GH_Skin.palette_hidden_selected
Hidden, selected palette. Default background for hidden (preview=off) parameters and components.