Grasshopper.Kernel.GH_Document.CreateExpressionSolver
Create a new Expression Solver preloaded with the constants defined in this document.

Grasshopper.Kernel.GH_Document.RemotePanelProxy
Gets or sets the Remote Control Panel proxy description for this document.

Grasshopper.Kernel.GH_Document.CreateCompleteProxy(System.Boolean,System.Boolean)
Create a complete RCP_Proxy instance for the entire document.
bIncludeCustomObjects: If True, custom objects will be included.
bIncludeFloatingParams: If True, floating parameters will be included.

Grasshopper.Kernel.GH_Document.RemoveObjects(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject},System.Boolean)
Remove the specified objects from the document. This removal is the precursor to object deletion.
Do not call this function if you intend to transfer the objects to another GH_Document.
This method does not add an Undo event, that is the responsibility of the caller.
objectList: Objectss to remove from this document.
update: If True, the solution will be recomputed.
Returns: The number of objects actually deleted.