Grasshopper.Plugin.GH_PluginUtil.LoadGrasshopper
Performs all steps required during Grasshopper loading.
If this function returns false, the plugin should not be allowed to load.
Returns: True on success, false on failure.

Grasshopper.Plugin.GH_PluginUtil.RegisterGrasshopperExtensions
This function will register all Grasshopper file extensions with Windows Explorer.
This functionality is now handled by the Plugin installer.