Grasshopper.GUI.Script.GH_ScriptEditor.DefaultAssemblies
Get a list of all the assemblies that are included by default for Scripts.

Grasshopper.GUI.Script.GH_ScriptEditor.SetSourceCode(Grasshopper.GUI.Script.GH_EditorCodeLines)
Set the source contents of the ScriptEditor window.
lines: Source code to assign.