Grasshopper.GUI.Gradient.GH_Gradient.MouseUp(System.Drawing.RectangleF,System.Drawing.PointF)
Terminate grip drag.
dest: Destination rectangle of gradient
pt: Mouse location in destination coordinates