Grasshopper.Kernel.GH_MemoryBitmap.OpaqueArea
Find the opaque area of a bitmap. The opaque area is the rectangle that contains pixels
with a colour that is now fully transparent.
Returns: Area of bitmap containing all non-transparent pixels.