Grasshopper.Kernel.GH_Param`1.Sources
Gets a list of source parameters. Do not modify this list,
if you wish to add or remove sources, use dedicated functions
like AddSource() and RemoveSource instead.
Returns: The sources for this parameter.

Grasshopper.Kernel.GH_Param`1.InstantiateT
Attempts to instantiate a new instance of T.
Remarks:
If T is an abstract class or if T has no default (empty) constructor, this function will ASSERT.
In order to avoid a Try...Catch block performance impact,
override this function and call the type constructor for T directly.

Grasshopper.Kernel.GH_Param`1.Cast_Object(System.Object)
Attempts to convert the Object reference into an instance of T.
This method will perform a direct cast if possible or it will call Casting functions on T or Data if they exist.
Data will not be duplicated unless a type conversion is required.
Data: Data to convert
Returns: The cast value or Nothing on failure.

Grasshopper.Kernel.GH_Param`1.PostProcessData
Apply data post-processes (simplify, reverse, graft, flatten etc. as well as overriddes processes).