Grasshopper.Kernel.Special.GH_PanelAttributes.m_boxBounds
A Rectangle accuracy version of the Bounds property.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_boxTitle
Represents the area in which the title text is displayed.
If no title text is displayed, the height of this area will be zero.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_boxContent
Represents the area in which the contents of the panel are displayed.
It is essentially the entire area minus the title area and minus the margins.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_boxScroll
Represents the area in which the scroll bar is free to move.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_boxScrollGrip
Represents the actual area of the scroll bar itself.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_boxScrollGripControl
Represents the scroll grip in control coordinates.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_boxIndices
Represents the area in which entry numbers are drawn.
If no entry numbers are included, the width of the area will be zero.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_boxItems
Represents the area in which the entries themselves are drawn.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_zuiRegions
Represents all 9 Zui buttons.