Grasshopper.Tracing.Beep(System.Int32,System.Int32)
Sound a beep. This only works if Grasshopper.dll was compiled in Debug mode.
frequency: Frequency of beep.
duration: Duration of beep.

Grasshopper.Tracing.Beep(System.Int32,System.Int32,System.UInt32)
Sound a beep. This only works if Grasshopper.dll was compiled in Debug mode.
frequency: Frequency of beep.
duration: Duration of beep.
repeats: Number of beep repeats.

Grasshopper.Tracing.Beep(System.Int32[],System.Int32)
Sound a beep. This only works if Grasshopper.dll was compiled in Debug mode.
frequencies: Frequencies of beep sequence.
duration: Duration of each frequency.

Grasshopper.Tracing.Ping(System.String)
Display a permanent message on screen. This only works if the Ping constant is set, which it isn't.
msg: Message to display.

Grasshopper.Tracing.Ping(System.String,System.Int32)
Display a permanent message on screen. This only works if the Ping constant is set, which it isn't.
msg: Message to display.
duration: Duration (in milliseconds) of message.