Grasshopper.Plugin.GH_RhinoScriptInterface.OpenDocument(System.String)
Open a Grasshopper document.
The editor will be loaded if necessary,
but it will not be automatically shown.
filename: Path of file to open (must be a *.gh or *ghx extension).
Returns: True on success, false on failure.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.OpenDocument("C:\ExampleFile.ghx")
Set GH = Nothing
End Sub