Grasshopper.Kernel.Geometry.Node2List.IsInside(Grasshopper.Kernel.Geometry.Node2)
Tests whether or not the node is inside this polygon. The Node2List is assumed to represent a closed, convex polygon for this function.
node: Node to test.