Grasshopper.Kernel.GH_Attributes`1.IsTooltipRegion(System.Drawing.PointF)
Determines whether a point is available for tooltip popups.
By default, IsMenuRegion calls IsPickRegion(PointF).
point: Point location to test.