Grasshopper.Kernel.GH_RcpProxy.Name
Gets or sets the name of the RCP Proxy.

Grasshopper.Kernel.GH_RcpProxy.GroupCount
Gets the number of groups contained in this proxy.

Grasshopper.Kernel.GH_RcpProxy.Groups
Gets the groups contained in this proxy.

Grasshopper.Kernel.GH_RcpProxy.ItemCount
Gets the total number of all items contained in all groups.

Grasshopper.Kernel.GH_RcpProxy.DeleteOverlap(Grasshopper.Kernel.GH_RcpProxy)
Remove all the items in me, which are also present in the other proxy.
other: Proxy to test against.

Grasshopper.Kernel.GH_RcpProxy.ContainsItem(System.Guid)
Tests for the existence of a specific item.
id: Item ID to search for.
Returns: True if the item is defined at least once.

Grasshopper.Kernel.GH_RcpProxy.DeleteItem(System.Guid)
Deletes all instances the specified item in all groups.
id: Item ID to delete.
Returns: Number of items deleted.

Grasshopper.Kernel.GH_RcpProxy.DeleteEmptyGroups
Deletes all empty groups from the proxy.
Returns: Number of groups deleted.

Grasshopper.Kernel.GH_RcpProxy
Represents the minimal description of a GH_RcpPanel layout.