Grasshopper.GUI.Canvas.GH_Canvas.GetCanvasScreenBuffer(Grasshopper.GUI.Canvas.GH_CanvasMode)
Get a bitmap that resembles the current state of the canvas.
modeOverride: The mode to apply during the off-screen rendering.
Returns: A bitmap similar to the current canvas display.