Grasshopper.Kernel.Types.GH_Material.#ctor(System.Guid)
Create a new Material from an RDK shader ID.
rdk_id: ID of RDK Shader.

Grasshopper.Kernel.Types.GH_Material.#ctor(Rhino.Display.DisplayMaterial)
Create a new Material.
other: Material to use (an internal copy will be made).

Grasshopper.Kernel.Types.GH_Material.RefreshReferenceData
If the material is a referenced material, this function will update the local values
to match the reference.