Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_masterIndex
Master parameter cache, do not access this directly, call MasterParameter() instead.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.MasterParameter
Attempts to find the most important input parameter that defines this operation.
Returns: The index of the master parameter or -1 if no master parameter can be identified.